{"items":[{"title":"How's that open source licensing coming along? That well, huh?","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/24/open_source_licensing/","pubDate":"2025-02-24T11:08:13.000Z","author":"Richard Speed","summary":"<h4>When a vendor and a community stop loving each other, things can get very forked up</h4> <p><strong>State Of Open</strong>  Multiple license changes have rocked the open source community over the last few years. For vendors concerned, the impact has ranged from business as usual to potentially catastrophic.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238619","isoDate":"2025-02-24T11:08:13.000Z"},{"title":"Beta of Unix version 2 restored to life","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/24/beta_unix_2_restored/","pubDate":"2025-02-24T10:15:06.000Z","author":"Liam Proven","summary":"<h4>What is dead may never die</h4> <p>After a heroic effort, the oldest machine-readable copy of Unix version 2 is running again.…</p>","id":"tag:theregister.com,2005:story238617","isoDate":"2025-02-24T10:15:06.000Z"},{"title":"Microsoft's Euro-mandated File Explorer surgery shows 'less is more' is still a thing","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/24/opinion_column_file_explorer/","pubDate":"2025-02-24T09:32:08.000Z","author":"Rupert Goodwins","summary":"<h4>Humble but with a huge history, the utility's privacy pare-back points to a productive possible future</h4> <p><strong>Opinion</strong>  Windows File Explorer doesn't get much love, poor thing. It gets sworn at if a sought file cannot be found, or if some setting is hiding that needs to be shown.…</p>","id":"tag:theregister.com,2005:story238610","isoDate":"2025-02-24T09:32:08.000Z"},{"title":"Untrained techie botched a big hardware sale by breaking client's ERP","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/24/who_me/","pubDate":"2025-02-24T08:30:08.000Z","author":"Simon Sharwood","summary":"<h4>'If I wasn't already taking blood pressure meds, I'm sure I would not have survived'</h4> <p><strong>Who, Me?</strong>  Nobody starts the working week by planning to fail, but mistakes do happen and <i>The Register</i> likes to write about them in Who, Me? It's the reader-contributed column in which you tell us how you escaped from nasty scrapes of your own making.…</p>","id":"tag:theregister.com,2005:story238609","isoDate":"2025-02-24T08:30:08.000Z"},{"title":"Maps of terrestrial fibre networks aren’t great. The Internet Society wants to fix that","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/24/isoc_ofds_network_maps/","pubDate":"2025-02-24T06:29:10.000Z","author":"Simon Sharwood","summary":"<h4>Wants regulators and carriers to adopt Open Fibre Data Standard to answer questions like ‘Is that one fibre, or nine?’</h4> <p><strong>APRICOT 2025</strong>  The Internet Society wants to help improve maps that depict terrestrial optic fibre networks by having regulators and carriers alike promote and adopt the Open Fibre Data Standard it helped to create.…</p>","id":"tag:theregister.com,2005:story238628","isoDate":"2025-02-24T06:29:10.000Z"},{"title":"Rather than add a backdoor, Apple decides to kill iCloud E2EE for UK peeps","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/24/rather_than_add_a_backdoor/","pubDate":"2025-02-24T03:31:05.000Z","author":"Brandon Vigliarolo","summary":"<h4>PLUS: SEC launches new crypto crime unit; Phishing toolkit upgraded; and more</h4> <p><strong>Infosec in brief</strong>  Apple has responded to the UK government's demand for access to its customers’ data stored in iCloud by deciding to turn off its Advanced Data Protection (ADP) end-to-end encryption service for UK users.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238621","isoDate":"2025-02-24T03:31:05.000Z"},{"title":"Trump administration threatens tariffs for any nation that dares to tax Big Tech","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/24/trump_administration_dst_countertariffs/","pubDate":"2025-02-24T00:31:47.000Z","author":"Simon Sharwood","summary":"<h4>Digital services taxes, network build levies, touted as violations of US sovereignty</h4> <p>United States president Donald Trump last Friday issued a memorandum that suggests imposition of tariffs on nations that dare to tax big tech companies.…</p>","id":"tag:theregister.com,2005:story238627","isoDate":"2025-02-24T00:31:47.000Z"},{"title":"As China embraces big tech again, Alibaba plans vast spend to push for artificial general intelligence","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/23/asia_tech_news_roundup/","pubDate":"2025-02-23T22:32:08.000Z","author":"Simon Sharwood","summary":"<h4>PLUS: Samsung exec jailed for selling DRAM secrets; ASUS launches sweetly scented mouse; Toyota’s smart city nears opening; and more</h4> <p><strong>Asia In Brief</strong>  PLUS: Samsung exec jailed for selling DRAM secrets; ASUS launches sweetly scented mouse; Toyota’s smart city nears opening; and more Chinese president Xi Jinping last week staged an event at which he urged private sector leaders, including China’s Big Tech companies, to help the nation speed its technological development.…</p>","id":"tag:theregister.com,2005:story238626","isoDate":"2025-02-23T22:32:08.000Z"},{"title":"If you thought training AI models was hard, try building enterprise apps with them","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/23/aleph_alpha_sovereign_ai/","pubDate":"2025-02-23T17:25:05.000Z","author":"Tobias Mann","summary":"<h4>Aleph Alpha's Jonas Andrulis on the challenges of building sovereign AI</h4> <p><strong>Interview</strong>  Despite the billions of dollars spent each year training large language models (LLMs), there remains a sizable gap between building a model and actually integrating it into an application in a way that's useful.…</p>","id":"tag:theregister.com,2005:story238144","isoDate":"2025-02-23T17:25:05.000Z"},{"title":"Here's the ugliest global-warming chart you'll ever need to see","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/23/ugliest_global_warming_chart/","pubDate":"2025-02-23T14:49:10.000Z","author":"Rik Myslewski","summary":"<h4>Earth is running a fever. That's not news. What's surprising is exactly how fast its temperature is rising</h4> <p><strong>Analysis</strong>  As you've likely read in many a headline-shouting article, our precious Blue Marble Earth just experienced its warmest year since reliable record-keeping began.…</p>","id":"tag:theregister.com,2005:story238624","isoDate":"2025-02-23T14:49:10.000Z"},{"title":"California goes ape with bill to crown Bigfoot official state cryptid","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/22/bigfoot_california_state_cryptid/","pubDate":"2025-02-22T12:36:09.000Z","author":"Richard Currie","summary":"<h4>Beast remains as mythical as the return on AI investment</h4> <p>Some muy importante legislation is stuck in the cogs of Californian bureaucracy – an Assembly Bill to recognize Bigfoot, aka Sasquatch, as the official state cryptid.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238614","isoDate":"2025-02-22T12:36:09.000Z"},{"title":"Binned off staff, slashed stock options. What's next? Ah yes, bigger C-suite bonuses","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/22/meta_pumps_executive_bonuses/","pubDate":"2025-02-22T09:49:11.000Z","author":"Brandon Vigliarolo","summary":"<h4>And really, nothing out of the ordinary for Silicon Valley</h4> <p>After another round of mass layoffs and reports of slashed stock options for remaining employees, Meta has like clockwork opted to reward its top executives with a substantial bonus increase.…</p>","id":"tag:theregister.com,2005:story238620","isoDate":"2025-02-22T09:49:11.000Z"},{"title":"Docker delays Hub pull limits by a month, tweaks maximums, stalls storage billing indefinitely","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/22/docker_hub_pull_limits/","pubDate":"2025-02-22T00:13:22.000Z","author":"Thomas Claburn","summary":"<h4>Image fetches to be capped on hourly basis for Personal, unauthenticated use, paid-for plans get unlimited access</h4> <p>Docker has delayed its plan to limit image pulls – the downloading of container images – from Docker Hub, by one month and has altered previously published quotas.…</p>","id":"tag:theregister.com,2005:story238622","isoDate":"2025-02-22T00:13:22.000Z"},{"title":"Data is very valuable, just don't ask us to measure it, leaders say","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/data_survey_analyst/","pubDate":"2025-02-21T23:04:11.000Z","author":"Lindsay Clark","summary":"<h4>After fifteen years of big hype, less than 25% of orgs measure value of data, analytics</h4> <p>Fifteen years of big data hype, and guess what? Less than one in four of those in charge of analytics projects actually measure the value of the activity to the organization they work for.…</p>","id":"tag:theregister.com,2005:story238597","isoDate":"2025-02-21T23:04:11.000Z"},{"title":"Los Alamos boffins slap blinkers on satellites so we know who to blame in a crash","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/lanl_elroi/","pubDate":"2025-02-21T21:11:10.000Z","author":"Dan Robinson","summary":"<h4>Extremely Low Resource Optical Identifier no brighter than LED, but readable with telescopes</h4> <p>Scientists at the Los Alamos National Laboratory (LANL) have come up with a cheap and simple way for satellites to be identified from the ground using lights to blink out an ID code.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238618","isoDate":"2025-02-21T21:11:10.000Z"},{"title":"T-Mobile US puts NYC emergency services in the 5G fast lane with network slicing","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/tmobile_5g_network_slicing/","pubDate":"2025-02-21T19:05:06.000Z","author":"Dan Robinson","summary":"<h4>911 gets VIP treatment in 'one of the most congested and demanding environments for connectivity'</h4> <p>T-Mobile US has signed a deal to provide telecoms for emergency services in New York City using network slicing to their ensure calls and data traffic are prioritized above other users.…</p>","id":"tag:theregister.com,2005:story238616","isoDate":"2025-02-21T19:05:06.000Z"},{"title":"Elon Musk calls for International Space Station to be deorbited by 2027","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/elon_musk_iss_mogensen_insult/","pubDate":"2025-02-21T17:03:06.000Z","author":"Richard Speed","summary":"<h4>Plus: ESA astronaut Andreas Mogensen not happy with SpaceX chief for 'lie' about 'abandoned' Starliner crew</h4> <p>SpaceX boss Elon Musk has called for the International Space Station (ISS) to be deorbited as soon as possible, perhaps by 2027.…</p>","id":"tag:theregister.com,2005:story238612","isoDate":"2025-02-21T17:03:06.000Z"},{"title":"ST Micro skips in, arm in arm with AWS, bearing a chip for 1.6 Tbps pluggable optics","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/st_micro_pluggables/","pubDate":"2025-02-21T15:00:06.000Z","author":"Tobias Mann","summary":"<h4>It's Friday. Quit the doomscrolling. Distract yourself with IT infra news</h4> <p>Developed in collaboration with Amazon Web Services, ST Micro detailed a new photonic integrated circuit (PIC) on Thursday that it says will support pluggable optics capable of shuttling bits around the datacenter at up to 1.6 Tbps.…</p>","id":"tag:theregister.com,2005:story238606","isoDate":"2025-02-21T15:00:06.000Z"},{"title":"Experts race to extract intel from Black Basta internal chat leaks","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/experts_race_to_extract_intel/","pubDate":"2025-02-21T12:56:05.000Z","author":"Connor Jones","summary":"<h4>Researchers say there's dissent in the ranks. Plus: An AI tool lets you have a go yourself at analysing the data</h4> <p>Hundreds of thousands of internal messages from the Black Basta ransomware gang were leaked by a Telegram user, prompting security researchers to bust out their best Russian translations post haste.…</p>","id":"tag:theregister.com,2005:story238615","isoDate":"2025-02-21T12:56:05.000Z"},{"title":"HP ditches 15-minute wait time policy due to 'feedback'","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/hp_ditches_15_minute_wait_time_call_centers/","pubDate":"2025-02-21T11:25:17.000Z","author":"Paul Kunert","summary":"<h4>It woz The Reg wot won it ... or maybe just common sense prevailed among management</h4> <p>HP Inc today abruptly ditched the mandatory 15-minute wait time that it imposed on customers dialling up its telephone-based support team due to \"initial feedback.\"…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238613","isoDate":"2025-02-21T11:25:17.000Z"},{"title":"Hey programmers – is AI making us dumber?","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/opinion_ai_dumber/","pubDate":"2025-02-21T10:17:50.000Z","author":"Steven J. Vaughan-Nichols","summary":"<h4>If you don't need to think about easy questions, will you be able to answer complex questions?</h4> <p><strong>Opinion</strong>  I don't want to sound like an aging boomer, yet when I see junior programmers relying on AI tools like Copilot, Claude, or GPT for simple coding tasks, I wonder if they're doing themselves more harm than good.…</p>","id":"tag:theregister.com,2005:story238588","isoDate":"2025-02-21T10:17:50.000Z"},{"title":"DIMM techies weren’t allowed to leave the building until proven to not be pilferers","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/on_call/","pubDate":"2025-02-21T08:30:08.000Z","author":"Simon Sharwood","summary":"<h4>Who knew a script could make RAM re-appear?</h4> <p><strong>On Call</strong>  Another Friday is upon us, and <i>The Register</i> understands some of you would rather not retain memories of the last week. That's why we offer another instalment of On Call, our reader-contributed column that revives your happier recollections of wreaking revenge on colleagues who caused you tech support trauma.…</p>","id":"tag:theregister.com,2005:story238587","isoDate":"2025-02-21T08:30:08.000Z"},{"title":"As Amazon takes over the Bond franchise, we submit our scripts for the next flick","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/amazon_bond_franchise_sold/","pubDate":"2025-02-21T07:34:08.000Z","author":"Iain Thomson","summary":"<h4>License To Kill -9 ... For Your iPhone Only ... AI Another Day ... The name's Bezos, Jeff Bezos</h4> <p>As part of its quest for world domination, Amazon has bought the creative rights to fictional British spy James Bond.…</p>","id":"tag:theregister.com,2005:story238607","isoDate":"2025-02-21T07:34:08.000Z"},{"title":"Ivanti endpoint manager can become endpoint ravager, thanks to quartet of critical flaws","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/ivanti_traversal_flaw_poc_exploit/","pubDate":"2025-02-21T06:51:08.000Z","author":"Jessica Lyons","summary":"<h4>PoC exploit code shows why this is a patch priority</h4> <p>Security engineers have released a proof-of-concept exploit for four critical Ivanti Endpoint Manager bugs, giving those who haven't already installed patches released in January extra incentive to revisit their to-do lists.…</p>","id":"tag:theregister.com,2005:story238605","isoDate":"2025-02-21T06:51:08.000Z"},{"title":"Lenovo isn't fussed by Trumpian tariffs or finding enough energy to run AI","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/lenovo_q3_2024/","pubDate":"2025-02-21T05:46:11.000Z","author":"Simon Sharwood","summary":"<h4>Enterprise hardware biz produced record revenue, just $1M of profit, but execs think losses are behind it</h4> <p>Lenovo believes its enterprise hardware business is finally on track to achieve consistent profits, if its customers can secure sufficient energy to buy more AI servers.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238608","isoDate":"2025-02-21T05:46:11.000Z"},{"title":"Thailand ready to welcome 7,000 trafficked scam call center victims back from Myanmar","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/thailand_ready_to_welcome_7000/","pubDate":"2025-02-21T03:30:06.000Z","author":"Connor Jones","summary":"<h4>It comes amid a major crackdown on the abusive industry that started during COVID</h4> <p>Thailand is preparing to receive thousands of people rescued from scam call centers in Myanmar as the country launches a major crackdown on the pervasive criminal activity across its border.…</p>","id":"tag:theregister.com,2005:story238593","isoDate":"2025-02-21T03:30:06.000Z"},{"title":"National Science Foundation staff axed by Trump fear for US scientific future","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/nsf_staff_cut/","pubDate":"2025-02-21T02:16:19.000Z","author":"Brandon Vigliarolo","summary":"<h4>An inside tale: Probation extended, tenure revoked, a scramble to merge research portfolios, and more</h4> <p><strong>Feature</strong>  With the National Science Foundation cutting staff to comply with President Trump's order for sweeping federal government layoffs, concerns are growing over the impact of these layoffs on America's role in scientific and technological research. …</p>","id":"tag:theregister.com,2005:story238603","isoDate":"2025-02-21T02:16:19.000Z"},{"title":"Linux royalty backs adoption of Rust for kernel code, says its rise is inevitable","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/21/linux_c_rust_debate_continues/","pubDate":"2025-02-21T00:38:46.000Z","author":"Thomas Claburn","summary":"<h4>Nobody wants memory bugs. Penguinistas continue debate on how to squish 'em</h4> <p><strong>Updated</strong>  Some Linux kernel maintainers remain unconvinced that adding Rust code to the open source project is a good idea, but its VIPs are coming out in support of the language's integration.…</p>","id":"tag:theregister.com,2005:story238604","isoDate":"2025-02-21T00:38:46.000Z"},{"title":"Microsoft expands Copilot bug bounty targets, adds payouts for even moderate messes","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/microsoft_copilot_bug_bounty_updated/","pubDate":"2025-02-20T23:55:52.000Z","author":"Jessica Lyons","summary":"<h4>Said bugs 'can have significant implications' – glad to hear that from Redmond</h4> <p>Microsoft is so concerned about security in its Copilot products for folks that it’s lifted bug bounty payments for moderate-severity vulnerabilities from nothing to a maximum of $5,000, and expanded the range of vulnerabilities it will pay people to find and report.…</p>","id":"tag:theregister.com,2005:story238601","isoDate":"2025-02-20T23:55:52.000Z"},{"title":"Oops, some of our customers' Power Pages-hosted sites were exploited, says Microsoft","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/microsoft_patch_power_pages/","pubDate":"2025-02-20T23:17:03.000Z","author":"Iain Thomson","summary":"<h4>Don't think this is SaaS and you can relax: Redmond wants a few of you to check your websites</h4> <p>Microsoft has fixed a security flaw in its Power Pages website-building SaaS, after criminals got there first – and urged users to check their sites for signs of exploitation.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238600","isoDate":"2025-02-20T23:17:03.000Z"},{"title":"GitLab and its execs sued again and again over 'misleading' AI hype, price hikes","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/gitlab_thrice_sued/","pubDate":"2025-02-20T21:53:13.000Z","author":"Thomas Claburn","summary":"<h4>Bosses bragged about Duo Chat bot, buyers weren’t buying it – claim</h4> <p>For the third time in five months, GitLab or its execs have been sued over allegedly misleading investors about AI capabilities and demand.…</p>","id":"tag:theregister.com,2005:story238602","isoDate":"2025-02-20T21:53:13.000Z"},{"title":"Laptop makers stalled on repairability improvements","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/laptop_manufacturers_repairability/","pubDate":"2025-02-20T18:18:13.000Z","author":"Brandon Vigliarolo","summary":"<h4>Apple, Dell made some progress, but MacBooks are still the worst to crack open, says PIRG</h4> <p>The right to repair movement has gained momentum, yet laptop makers have largely stalled on improving repairability.…</p>","id":"tag:theregister.com,2005:story238595","isoDate":"2025-02-20T18:18:13.000Z"},{"title":"Euro cloud biz trials 'server blades in a cold box' system","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/diggers_exoscale_liquid_cooling/","pubDate":"2025-02-20T17:39:04.000Z","author":"Dan Robinson","summary":"<h4>Hot air or a 50% energy saving? Exoscale datacenter runs proof-of-concept to test veracity of Digger's claims</h4> <p>A1 Digital is testing liquid cooling tech for power-intensive AI servers that is claimed to save 50 percent of the energy previously required for cooling, doing away entirely with the need for air conditioning.…</p>","id":"tag:theregister.com,2005:story238598","isoDate":"2025-02-20T17:39:04.000Z"},{"title":"US minerals company says crooks broke into email and helped themselves to $500K","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/niocorp_bec_scam/","pubDate":"2025-02-20T16:44:51.000Z","author":"Connor Jones","summary":"<h4>A painful loss for young company that's yet to generate revenue</h4> <p>A NASDAQ-listed US minerals company says cybercriminals broke into its systems on Valentine's Day and paid themselves around $500,000 – money earmarked for a vendor.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238594","isoDate":"2025-02-20T16:44:51.000Z"},{"title":"Microsoft Azure faceplants in Norway, taking government services with it","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/microsoft_azure_outage_norway/","pubDate":"2025-02-20T16:00:44.000Z","author":"Paul Kunert","summary":"<h4>Locals see red as public cloud's service health dashboard shows green</h4> <p>Norwegians fell victim to a prolonged Microsoft Azure outage today, which impacted businesses and took down multiple government websites delivering online services to citizens.…</p>","id":"tag:theregister.com,2005:story238596","isoDate":"2025-02-20T16:00:44.000Z"},{"title":"NASA's on-again, off-again job cuts – what's the plan?","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/nasa_comment_piece/","pubDate":"2025-02-20T15:30:06.000Z","author":"Richard Speed","summary":"<h4>Lucky there isn't an asteroid headed for Earth for which a demoralized space agency might need to mount a redirect mission</h4> <p><strong>Comment</strong>  The US space agency, NASA, is famous for looking to the future. However, the fiasco of the last few days has cast doubt on the present, let alone what the coming weeks, months, or years might hold.…</p>","id":"tag:theregister.com,2005:story238576","isoDate":"2025-02-20T15:30:06.000Z"},{"title":"Critical flaws in Mongoose library expose MongoDB to data thieves, code execution","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/mongoose_flaws_mongodb/","pubDate":"2025-02-20T14:45:14.000Z","author":"Connor Jones","summary":"<h4>Bugs fixed, updating to the latest version is advisable</h4> <p>Security sleuths found two critical vulnerabilities in a third-party library that MongoDB relies on, which means bad guys can potentially steal data and run code.…</p>","id":"tag:theregister.com,2005:story238497","isoDate":"2025-02-20T14:45:14.000Z"},{"title":"Talk of Broadcom and TSMC grabbing pieces of Intel lights fire under investors","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/intel_carveup/","pubDate":"2025-02-20T14:00:13.000Z","author":"Dan Robinson","summary":"<h4>Chipzilla's design and manufacturing limbs said to be on the table</h4> <p>Venture capitalists are circling Intel amid talk that the beleaguered chip giant may be carved up between Broadcom and TSMC, with one taking the design biz and the other the manufacturing fabs.…</p>","id":"tag:theregister.com,2005:story238590","isoDate":"2025-02-20T14:00:13.000Z"},{"title":"Insiders say IBM's broader return-to-office plan hits older, more expensive staff hard","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/ibm_colocation_program_described_as/","pubDate":"2025-02-20T13:29:05.000Z","author":"Thomas Claburn","summary":"<h4>IT giant doing whatever it takes to reach $300 a share</h4> <p>IBM is looking to reduce expenses through what's described as a co-location program that, according to current and former employees who spoke with <em>The Register</em>, appears to be designed to drive out older, more expensive workers.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238584","isoDate":"2025-02-20T13:29:05.000Z"},{"title":"HP deliberately adds 15 minutes waiting time for telephone support calls","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/hp_deliberately_adds_15_minutes/","pubDate":"2025-02-20T13:00:11.000Z","author":"Paul Kunert","summary":"<h4>Stalling tactics designed to push print or PC users to online support, sorry, 'self-solve'</h4> <p><strong>Updated</strong>  HP Inc is trying to force consumer PC and print customers to use online and other digital support channels by setting a minimum 15-minute wait time for anyone that phones the call center to get answers to troublesome queries.…</p>","id":"tag:theregister.com,2005:story238592","isoDate":"2025-02-20T13:00:11.000Z"},{"title":"UK tax authority eyes £880M overhaul for Northern Ireland trade services","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/hmrc_ni_trade_services/","pubDate":"2025-02-20T12:26:51.000Z","author":"Lindsay Clark","summary":"<h4>Cost of post-Brexit arrangements revealed as HMRC looks at options following Fujitsu contract</h4> <p>The UK's tax collector is looking for a tech supplier to take on a £370 million, seven-year contract to support a digital platform and call center to handle trading arrangements over the Northern Ireland border.…</p>","id":"tag:theregister.com,2005:story238591","isoDate":"2025-02-20T12:26:51.000Z"},{"title":"Two arrested after pensioner scammed out of six-figure crypto nest egg","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/aberdeen_crypto_scam_arrests/","pubDate":"2025-02-20T11:35:30.000Z","author":"Connor Jones","summary":"<h4>The latest in a long line of fraud stings worth billions each year</h4> <p>Two men are in police custody after being arrested in connection with a July cryptocurrency fraud involving a man in his seventies.…</p>","id":"tag:theregister.com,2005:story238589","isoDate":"2025-02-20T11:35:30.000Z"},{"title":"Dark mode might be burning more juice than you think","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/dark_mode_energy_saving/","pubDate":"2025-02-20T10:15:12.000Z","author":"Dan Robinson","summary":"<h4>Most people crank up the brightness, making energy savings moot</h4> <p>Using apps and websites in dark mode can actually use more energy than standard mode, according to researchers, as it causes people to crank up the brightness.…</p>","id":"tag:theregister.com,2005:story238573","isoDate":"2025-02-20T10:15:12.000Z"},{"title":"DXC paid 50% more than original contract value for disastrous public sector Oracle project","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/dxc_oracle_uk_contract/","pubDate":"2025-02-20T09:30:14.000Z","author":"Lindsay Clark","summary":"<h4>Systems integrator secured 'variation' just before mega SAP migration put on hold</h4> <p>Systems integrator DXC accrued over 50 percent more than its original contract value for completing less than half the scheduled contract term during a disastrous project to move a UK government body off an ageing SAP ERP system and onto Oracle Fusion.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238572","isoDate":"2025-02-20T09:30:14.000Z"},{"title":"Ghost ransomware crew continues to haunt IT depts with scarily bad infosec","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/fbi_beware_of_ghost_ransomware/","pubDate":"2025-02-20T08:41:14.000Z","author":"Jessica Lyons","summary":"<h4>FBI and CISA issue reminder - deep sigh - about the importance of patching and backups</h4> <p>The operators of Ghost ransomware continue to claim victims and score payments, but keeping the crooks at bay is possible by patching known vulnerabilities and some basic infosec actions, according to a joint advisory issued Wednesday by the FBI and US Cybersecurity and Infrastructure Security Agency.…</p>","id":"tag:theregister.com,2005:story238583","isoDate":"2025-02-20T08:41:14.000Z"},{"title":"Medusa ransomware gang demands $2M from UK private health services provider","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/medusa_hcrg_ransomware/","pubDate":"2025-02-20T07:34:12.000Z","author":"Iain Thomson","summary":"<h4>2.3 TB held to ransom as biz formerly known as Virgin Care tells us it's probing IT 'security incident'</h4> <p><strong>Exclusive</strong>  HCRG Care Group, a private health and social services provider, has seemingly fallen victim to the Medusa ransomware gang, which is threatening to leak what's claimed to be stolen internal records unless a substantial ransom is paid.…</p>","id":"tag:theregister.com,2005:story238582","isoDate":"2025-02-20T07:34:12.000Z"},{"title":"A big AI build has ‘stalled’ and won’t happen this year as funds and GPUs prove elusive","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/a_big_ai_build_has/","pubDate":"2025-02-20T06:29:11.000Z","author":"Simon Sharwood","summary":"<h4>Arista trumpeted its role in this project for a year. Good thing business is otherwise solid</h4> <p>Big Tech’s plans to spend hundreds of billions on infrastructure during 2025 are often considered to demonstrate near-endless demand for artificial intelligence, but networking vendor Arista has just revealed a large AI build has “stalled” due to lack of funds and hardware.…</p>","id":"tag:theregister.com,2005:story238585","isoDate":"2025-02-20T06:29:11.000Z"},{"title":"France tops China’s tokamak record with 22-minute plasma containment run","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/france_tops_chinas_tokamak_record/","pubDate":"2025-02-20T05:45:08.000Z","author":"Simon Sharwood","summary":"<h4>Nice number, but also not much more than a nice advance</h4> <p>France’s Commissariat à L'énergie Atomique et aux Energies Alternatives on Tuesday claimed it’s topped China’s recently-established for record maintaining fusion plasma in a tokamak, and therefore taken another step towards building a fusion reactor capable of producing cheap energy.…</p>","id":"tag:theregister.com,2005:story238586","isoDate":"2025-02-20T05:45:08.000Z"},{"title":"US Army soldier linked to Snowflake extortion rampage admits breaking the law","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/20/us_army_snowflake_theft/","pubDate":"2025-02-20T03:01:39.000Z","author":"Iain Thomson","summary":"<h4>That's the way the cookie melts</h4> <p>A US Army soldier suspected of hacking AT&amp;T and Verizon has admitted leaking online people's private call records.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238579","isoDate":"2025-02-20T03:01:39.000Z"},{"title":"Trump can't quickly or easily kill the CHIPS Act, but he can fire the workers funded by it","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/19/trump_layoffs_nist/","pubDate":"2025-02-19T23:36:06.000Z","author":"Tobias Mann","summary":"<h4>Reported layoffs suggest R&amp;D functions may be hobbled, fab subsidies also at risk</h4> <p><strong>Comment</strong>  US President Donald Trump has made it plain he’s not a fan of the $53 billion CHIPS and Science Act that funds semiconductor manufacturing and research on American soil – and now it appears he’s decided to make substantial staff cuts at the agencies that administer it.…</p>","id":"tag:theregister.com,2005:story238581","isoDate":"2025-02-19T23:36:06.000Z"}],"link":"https://www.theregister.com/","feedUrl":"https://www.theregister.com/headlines.atom","title":"The Register","lastBuildDate":"2025-02-24T11:08:13.00Z"}