{"items":[{"title":"Already three years late, NHS finance system replacement delayed again","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/11/nhs_finance_system_delayed/","pubDate":"2025-02-11T11:01:06.000Z","author":"Lindsay Clark","summary":"<h4>Project to swap out Oracle E-Business Suite gets another red rating from projects watchdog</h4> <p>The UK's largest NHS management body has postponed the replacement of its aging Oracle finance system again following more than three years of delays.…</p>","id":"tag:theregister.com,2005:story238433","isoDate":"2025-02-11T11:01:06.000Z"},{"title":"Euro cloud crew says we-won't-sue deal with Microsoft is 'off-track'","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/11/microsoft_criticized_by_euro_cloud/","pubDate":"2025-02-11T10:21:27.000Z","author":"Paul Kunert","summary":"<h4>Overseas pals urge US tech giant to 'rapidly' work on Azure Local project to make things right – sans licenses</h4> <p>Microsoft is not on track to meet technical commitments that form the basis of a settlement agreement intended to resolve a legal dispute over software licensing with a gaggle of cloud providers in Europe.…</p>","id":"tag:theregister.com,2005:story238440","isoDate":"2025-02-11T10:21:27.000Z"},{"title":"UK government using AI tools to check up on roadworthy testing centers","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/11/ai_tools_mot_testing/","pubDate":"2025-02-11T09:30:06.000Z","author":"Richard Speed","summary":"<h4>Who tests the testers?</h4> <p>The UK's Department for Science, Innovation and Technology (DSIT) has produced a list showing how the country uses AI technologies to perform tasks ranging from speeding up the planning process to prioritizing the inspection of MOT testing centers.…</p>","id":"tag:theregister.com,2005:story238429","isoDate":"2025-02-11T09:30:06.000Z"},{"title":"RIP Raymond Bird: Designer of UK's first mass-produced business computer dies aged 101","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/11/hollerith_electronic_computer_designer_raymond_bird/","pubDate":"2025-02-11T08:33:13.000Z","author":"Thomas Claburn","summary":"<h4>Engineer was behind the HEC series and more</h4> <p><strong>Obit</strong>  Raymond Bird, who developed the UK's first mass-produced business computer, the Hollerith Electronic Computer (HEC), has died at the digitally apropos age of 101.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238444","isoDate":"2025-02-11T08:33:13.000Z"},{"title":"Only 4 percent of jobs rely heavily on AI, with peak use in mid-wage roles","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/11/ai_impact_hits_midtohigh_wage_jobs/","pubDate":"2025-02-11T07:31:09.000Z","author":"Thomas Claburn","summary":"<h4>Mid-salary knowledge jobs in tech, media, and education are changing. Folk in physical jobs have less to sweat about</h4> <p>Workers in just four percent of occupations use AI for three quarters of their tasks, according to research from Anthropic that explores how its Claude model is used.…</p>","id":"tag:theregister.com,2005:story238439","isoDate":"2025-02-11T07:31:09.000Z"},{"title":"NASA’s radiation tolerant computer lives up to its name after surviving Van Allen belts","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/11/nasa_radpc_firefly_moon_mission/","pubDate":"2025-02-11T05:56:15.000Z","author":"Simon Sharwood","summary":"<h4>'RadPC' flew on Firefly’s Ghost Riders in the Sky mission, which has left Earth Orbit and is headed for the Moon</h4> <p>NASA has revealed its experimental Radiation Tolerant Computer has made it through the famously and furiously radiating Van Allen belts in one piece.…</p>","id":"tag:theregister.com,2005:story238446","isoDate":"2025-02-11T05:56:15.000Z"},{"title":"January earthquake shook $165M off TSMC’s revenue forecast","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/11/tsmc_taiwan_earthquake_financial_impact/","pubDate":"2025-02-11T03:58:08.000Z","author":"Simon Sharwood","summary":"<h4>Promises production schedule will get back on track</h4> <p>Taiwanese chipmaking champion TSMC has revealed that a January earthquake will cost it millions.…</p>","id":"tag:theregister.com,2005:story238445","isoDate":"2025-02-11T03:58:08.000Z"},{"title":"Apple warns 'extremely sophisticated attack' may be targeting iThings","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/11/apple_ios_ipados_patches/","pubDate":"2025-02-11T01:58:06.000Z","author":"Iain Thomson","summary":"<h4>Cupertino mostly uses bland language when talking security, so this sounds nasty</h4> <p>Apple has warned that some iPhones and iPads may have been targeted by an “extremely sophisticated attack” and has posted patches that hopefully prevent it.…</p>","id":"tag:theregister.com,2005:story238443","isoDate":"2025-02-11T01:58:06.000Z"},{"title":"Some workers already let AI do the thinking for them, Microsoft researchers find","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/11/microsoft_study_ai_critical_thinking/","pubDate":"2025-02-11T00:31:09.000Z","author":"Brandon Vigliarolo","summary":"<h4>Dammit, that was our job here at <i>The Reg</i>. Now if you get a task you don't understand, you may assume AI has the answers</h4> <p>Some knowledge workers risk becoming over-reliant on generative AI and their problem-solving skills may decline as a result, according to a study penned by researchers from Microsoft Research and Carnegie Mellon University.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238437","isoDate":"2025-02-11T00:31:09.000Z"},{"title":"All your 8Base are belong to us: Ransomware crew busted in global sting","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/8base_police_arrrest/","pubDate":"2025-02-10T22:15:13.000Z","author":"Iain Thomson","summary":"<h4>Dark web site seized, four cuffed in Thailand</h4> <p>An international police operation spanning the US, Europe, and Asia has shuttered the 8Base ransomware crew's dark web presence and resulted in the arrest of four European suspects accused of stealing $16 million from more than 1,000 victims worldwide.…</p>","id":"tag:theregister.com,2005:story238438","isoDate":"2025-02-10T22:15:13.000Z"},{"title":"Intel loses another exec as datacenter, AI chief named Nokia CEO","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/intel_hotard_nokia/","pubDate":"2025-02-10T20:45:10.000Z","author":"Tobias Mann","summary":"<h4>Justin Hotard tapped to replace Pekka Lundmark at the Finnish telco</h4> <p>Intel is going to need more than a new CEO after its Datacenter and AI (DCAI) chief on Monday announced he's leaving to run Nokia as its next chief executive.…</p>","id":"tag:theregister.com,2005:story238435","isoDate":"2025-02-10T20:45:10.000Z"},{"title":"Reclassification is making US tech job losses look worse than they are","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/january_it_hiring/","pubDate":"2025-02-10T18:30:14.000Z","author":"Brandon Vigliarolo","summary":"<h4>IT hiring ticks up in January, but unemployment climbs to 5.7%</h4> <p>The latest job numbers from the US Bureau of Labor Statistics make IT hiring look like it's in freefall, but that's not the case at all, says consultancy firm Janco. …</p>","id":"tag:theregister.com,2005:story238432","isoDate":"2025-02-10T18:30:14.000Z"},{"title":"Meta's plan to erase 5% of workforce starts today","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/meta_to_toss_5_of/","pubDate":"2025-02-10T17:35:07.000Z","author":"Paul Kunert","summary":"<h4>'Intense year' ahead, warned Zuck. Got to spend billions on AI and work to stay out of Trump's bad books</h4> <p>Meta has confirmed to <em>The Register</em> that today marks the start of a mass redundancy process with thousands of workers getting the chop.…</p>","id":"tag:theregister.com,2005:story238430","isoDate":"2025-02-10T17:35:07.000Z"},{"title":"T-Mobile goes live with beta of satellite phone service for the US","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/tmobile_goes_live_with_beta/","pubDate":"2025-02-10T16:32:06.000Z","author":"Dan Robinson","summary":"<h4>Free text messages for users of its own and rival networks during test period</h4> <p>T-Mobile US has started a public beta of its Direct-to-Cell service using Starlink satellites, offering just text messages for now, with data and voice calls coming later. Access will be free until July – after which it will cost $15 per month.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238426","isoDate":"2025-02-10T16:32:06.000Z"},{"title":"Boeing warns SLS staff that job cuts could be on the way","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/boeing_warns_sls_staff_that/","pubDate":"2025-02-10T15:28:10.000Z","author":"Richard Speed","summary":"<h4>Overdue, over budget and now... perhaps just over?</h4> <p>Boeing has notified staff that hundreds of jobs could be eliminated if the Artemis program is canceled or heavily revised.…</p>","id":"tag:theregister.com,2005:story238428","isoDate":"2025-02-10T15:28:10.000Z"},{"title":"The biggest microcode attack in our history is underway","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/microcode_attack_trump_musk/","pubDate":"2025-02-10T14:36:06.000Z","author":"Rupert Goodwins","summary":"<h4>When your state machines are vulnerable, all bets are off</h4> <p><strong>Opinion</strong>  All malicious attacks on digital systems have one common aim: taking control. Mostly, that means getting a CPU somewhere to turn traitor, running code that silently steals or scrambles your data. That code can ride into the system in a whole spectrum of ways, but usually it has to be in memory somewhere at some time, making it amenable to counter-attack.…</p>","id":"tag:theregister.com,2005:story238402","isoDate":"2025-02-10T14:36:06.000Z"},{"title":"Sri Lanka goes bananas after monkey unplugs nation","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/sri_lanka_monkey_blackout/","pubDate":"2025-02-10T13:51:47.000Z","author":"Richard Currie","summary":"<h4>Simian saboteur or a grid screaming for modernization?</h4> <p>Sri Lanka's electricity grid was brought down nationwide on Sunday after monkey business struck a power station south of the capital of Colombo.…</p>","id":"tag:theregister.com,2005:story238427","isoDate":"2025-02-10T13:51:47.000Z"},{"title":"US news org still struggling to print papers a week after 'cybersecurity event'","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/us_newspapers_lee_enterprises_cyberattack/","pubDate":"2025-02-10T13:05:26.000Z","author":"Connor Jones","summary":"<h4>Publications across 25 states either producing smaller issues or very delayed ones</h4> <p>US newspaper publisher Lee Enterprises is one week into tackling a nondescript \"cybersecurity event,\" saying the related investigation may take \"weeks or longer\" to complete.…</p>","id":"tag:theregister.com,2005:story238425","isoDate":"2025-02-10T13:05:26.000Z"},{"title":"CentOS Connect conference announces return of Firefox","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/centos_firefox/","pubDate":"2025-02-10T12:47:09.000Z","author":"Liam Proven","summary":"<h4>OKD project also has its own immutable CentOS image, which could be fun</h4> <p><strong>FOSDEM 2025</strong>  CentOS Connect, the FOSDEM-adjacent meetup, delivered a few notable updates: Firefox is returning as a native package on CentOS, an immutable Stream variant is being explored, and AlmaLinux is doing things its own way.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238410","isoDate":"2025-02-10T12:47:09.000Z"},{"title":"Legacy systems running UK's collector are taxing – in more ways than one","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/legacy_costs_hmrc/","pubDate":"2025-02-10T12:03:18.000Z","author":"Lindsay Clark","summary":"<h4>Costs for fixing them and keeping them working up by 390%, NAO report reveals</h4> <p><strong>Updated</strong>  Costs associated with the remediation of the UK tax collector's legacy systems have risen by up to 390 percent, according to a new report from government auditors.…</p>","id":"tag:theregister.com,2005:story238424","isoDate":"2025-02-10T12:03:18.000Z"},{"title":"London has 400 GW of grid requests holding up datacenter builds","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/london_has_400_gw_of/","pubDate":"2025-02-10T10:28:10.000Z","author":"Dan Robinson","summary":"<h4>And up to 70% of stalled energy generation projects are unlikely to be approved, claims regulator Ofgem</h4> <p>While the UK government wants to turbocharge datacenter construction, a newly published report says there are already 400 GW worth of outstanding requests for connection to the power grid around London, and regulator Ofgem estimates 60-70 percent of these will never happen.…</p>","id":"tag:theregister.com,2005:story238411","isoDate":"2025-02-10T10:28:10.000Z"},{"title":"UK armed forces fast-tracking cyber warriors to defend digital front lines","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/uk_armed_forces_cyber_hires/","pubDate":"2025-02-10T09:30:13.000Z","author":"Connor Jones","summary":"<h4>High starting salaries promised after public sector infosec pay criticized</h4> <p>The UK's Ministry of Defence (MoD) is fast-tracking cybersecurity specialists in a bid to fortify its protection against increasing attacks.…</p>","id":"tag:theregister.com,2005:story238407","isoDate":"2025-02-10T09:30:13.000Z"},{"title":"Does this thing run on a 220 V power supply? Oh. That puff of smoke suggests not","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/who_me/","pubDate":"2025-02-10T08:30:09.000Z","author":"Simon Sharwood","summary":"<h4>That's not even the worst part of this story, which features a flood, broken promises, and plenty of panic</h4> <p><strong>Who, Me?</strong>  The working week has rolled around again, bringing with it the promise of new achievements – and the chance to mess things up in ways that we cover here in \"Who, Me?\" <i>The Register</i>'s reader-contributed column in which you admit to your failures.…</p>","id":"tag:theregister.com,2005:story238401","isoDate":"2025-02-10T08:30:09.000Z"},{"title":"Cloudflare hopes to rebuild the Web for the AI age - with itself in the middle","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/cloudflare_q4_2024_ai_web/","pubDate":"2025-02-10T07:34:09.000Z","author":"Simon Sharwood","summary":"<h4>Also claims it’s found DeepSeek-eque optimizations that reduce AI infrastructure requirements</h4> <p>Cloudflare has declared it’s found optimizations that reduce the amount of hardware needed for inferencing workloads, and is in early talks to re-invent the World Wide Web for the age of AI…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238423","isoDate":"2025-02-10T07:34:09.000Z"},{"title":"Judge says US Treasury ‘more vulnerable to hacking’ since Trump let the DOGE out","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/doge_infosec_impact_court_order/","pubDate":"2025-02-10T06:32:09.000Z","author":"Simon Sharwood","summary":"<h4>Order requires destruction of departmental data accessed by Musky men</h4> <p>Trump administration policies that allowed Elon Musk's Department of Government Efficiency to access systems and data at the Bureau of the Fiscal Service (BFS) have left the org “more vulnerable to hacking” according to federal Judge Paul A. Engelmayer in New York City.…</p>","id":"tag:theregister.com,2005:story238422","isoDate":"2025-02-10T06:32:09.000Z"},{"title":"India's banking on the bank.in domain cleaning up its financial services sector","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/india_bank_dotin_plan/","pubDate":"2025-02-10T04:31:09.000Z","author":"Simon Sharwood","summary":"<h4>With over 2,000 banks in operation, a domain only they can use has potential to make life harder for fraudsters</h4> <p>India’s Reserve Bank last week announced a plan to use adopt dedicated second-level domains – bank.in and fin.in – in the hope it improves trust in the financial services sector.…</p>","id":"tag:theregister.com,2005:story238421","isoDate":"2025-02-10T04:31:09.000Z"},{"title":"DeepSeek's iOS app is a security nightmare, and that's before you consider its TikTok links","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/10/infosec_in_brief/","pubDate":"2025-02-10T02:30:15.000Z","author":"Brandon Vigliarolo","summary":"<h4>PLUS: Spanish cops think they've bagged NATO hacker; HPE warns staff of data breach; Lazy Facebook phishing, and more!</h4> <p><strong>Infosec In Brief</strong>  DeepSeek’s iOS app is a security nightmare that you should delete ASAP, according to researchers at mobile app infosec platform vendor NowSecure.…</p>","id":"tag:theregister.com,2005:story238417","isoDate":"2025-02-10T02:30:15.000Z"},{"title":"Huawei revenue growing fast, suggesting China's scoffing at sanctions","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/09/asia_tech_news_in_brief/","pubDate":"2025-02-09T23:59:10.000Z","author":"Simon Sharwood","summary":"<h4>PLUS: Japan shifts to pre-emptive cyber-defense; Thailand cuts cords connecting scam camps; China to launch 'moon hopper' in 2026; and more!</h4> <p><strong>Asia In Brief</strong>  Huawei chair Liang Hua last week told a conference in China that the company expects to meet its revenue targets for 2024, meaning it earned around ¥860 billion ($118.25 billion) – 22 percent growth compared to its 2023 result.…</p>","id":"tag:theregister.com,2005:story238420","isoDate":"2025-02-09T23:59:10.000Z"},{"title":"Does DOGE have what it takes to actually tackle billions in US govt IT spending?","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/08/doge_us_goverment_tech_spending/","pubDate":"2025-02-08T13:09:12.000Z","author":"Lindsay Clark","summary":"<h4>Tesla’s DIY ERP legend meets the messy reality of entrenched federal contracts</h4> <p><strong>Comment</strong>  Tesla reportedly decided not to upgrade its SAP's enterprise software a decade ago, opting to build its own system instead. Now, with Elon Musk heading up the Trump-blessed US Department of Government Efficiency (DOGE), his cost-cutting mindset could have major implications for federal IT spending - and the big tech vendors cashing in on government contracts.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238414","isoDate":"2025-02-08T13:09:12.000Z"},{"title":"France, UAE to drop €50B on AI mega-datacenter. Still nowhere near America’s $500B bet","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/08/uae_france_dc_ai/","pubDate":"2025-02-08T10:44:05.000Z","author":"Tobias Mann","summary":"<h4>Oh look, a mini Stargate, how quaint</h4> <p>The United Arab Emirates (UAE) and France this week announced plans for a one-gigawatt AI datacenter campus dedicated to advancing development of artificial intelligence.…</p>","id":"tag:theregister.com,2005:story238415","isoDate":"2025-02-08T10:44:05.000Z"},{"title":"New boss for Roscosmos as Yury Borisov binned","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/08/roscosmos_new_leader/","pubDate":"2025-02-08T09:30:07.000Z","author":"Richard Speed","summary":"<h4>Vladimir Putin opens airlock after just three years</h4> <p>Roscosmos boss Yury Borisov has been fired from the Russian space agency by executive order of the country's president, Vladimir Putin.…</p>","id":"tag:theregister.com,2005:story238404","isoDate":"2025-02-08T09:30:07.000Z"},{"title":"Amazon, Google asked to explain why they were serving ads on sites hosting CSAM","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/08/amazon_google_accused_of_monetizing/","pubDate":"2025-02-08T04:09:44.000Z","author":"Thomas Claburn","summary":"<h4>And US government adverts at that, say senators</h4> <p><strong>Updated</strong>  US Senators Marsha Blackburn (R-TN) and Richard Blumenthal (D-CT) on Friday sent letters to the CEOs of Amazon and Google asking why their ad businesses fund websites hosting child sexual abuse material (CSAM) and allow government ads to appear on sites with illegal imagery.…</p>","id":"tag:theregister.com,2005:story238418","isoDate":"2025-02-08T04:09:44.000Z"},{"title":"Trump's Dept of Transport hits brakes on Biden’s EV charger build-out","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/biden_ev_charger_program_unplugged/","pubDate":"2025-02-07T22:54:10.000Z","author":"Brandon Vigliarolo","summary":"<h4>Funding freeze while Feds review priorities</h4> <p>If you were hoping the Biden administration's $5 billion investment in building a cross-country network of EV chargers would soon have you road-tripping in an electric car without range anxiety, think again: The Trump-led US Dept of Transport has put the plan under review and halted new funding.…</p>","id":"tag:theregister.com,2005:story238412","isoDate":"2025-02-07T22:54:10.000Z"},{"title":"'Maybe the problem is you' ... Linus Torvalds wades into Linux kernel Rust driver drama","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/linus_torvalds_rust_driver/","pubDate":"2025-02-07T21:44:22.000Z","author":"Thomas Claburn","summary":"<h4>Open source project chief hits out at 'social media brigading'</h4> <p>Weighing in on yet another Linux kernel spat - this time over Rust device drivers - Linux supremo Linus Torvalds has shot the messenger.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238416","isoDate":"2025-02-07T21:44:22.000Z"},{"title":"NASA solar mission data recovering after server room flood fiasco","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/nasa_solar_mission_data_recovering/","pubDate":"2025-02-07T19:15:09.000Z","author":"Richard Speed","summary":"<h4>Spacecraft weather solar storms, but ground processing laid low by water</h4> <p>They can put a man on the Moon - but back on Earth, a busted water pipe managed to knock out NASA's solar mission data for months.…</p>","id":"tag:theregister.com,2005:story238408","isoDate":"2025-02-07T19:15:09.000Z"},{"title":"UK Home Office silent on alleged Apple backdoor order","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/home_office_apple_backdoor_order/","pubDate":"2025-02-07T17:03:54.000Z","author":"Connor Jones","summary":"<h4>Blighty’s latest stab at encryption? A secret order to pry open iCloud, sources claim</h4> <p>The UK's Home Office refuses to either confirm or deny reports that it recently ordered Apple to create a backdoor allowing the government to access any user's cloud data.…</p>","id":"tag:theregister.com,2005:story238413","isoDate":"2025-02-07T17:03:54.000Z"},{"title":"SoftBank woos OpenAI with $40B, making Microsoft's $13B look quaint","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/softbank_invests_40b_openai/","pubDate":"2025-02-07T16:30:08.000Z","author":"Brandon Vigliarolo","summary":"<h4>Some of that cash is reportedly headed for $500B Stargate dream</h4> <p>The AI investment landscape is shifting once again, with SoftBank reportedly finalizing a $40 billion stake in OpenAI - pushing its valuation to around $300 billion.…</p>","id":"tag:theregister.com,2005:story238409","isoDate":"2025-02-07T16:30:08.000Z"},{"title":"Datacenter energy use to more than double by 2030 thanks to AI's insatiable thirst","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/datacenter_energy_goldman_sachs/","pubDate":"2025-02-07T15:00:09.000Z","author":"Dan Robinson","summary":"<h4>Shocking research warns electricity shortages could create construction bottleneck</h4> <p>AI's thirst for electricity will see datacenter energy use more than double by the end of the decade – just five years from now – according to the latest forecast from investment banker Goldman Sachs.…</p>","id":"tag:theregister.com,2005:story238406","isoDate":"2025-02-07T15:00:09.000Z"},{"title":"Microsoft 365 price rises are coming – pay up or opt out (if you can find the button)","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/microsoft_365_price_rises/","pubDate":"2025-02-07T13:34:53.000Z","author":"Richard Speed","summary":"<h4>It's not auto-enrollment. It's just your current plan with extra Copilot for more money. Completely different</h4> <p>Users are now receiving notifications regarding their Microsoft 365 subscriptions and must take action if they wish to avoid Copilot and its extra charges.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238405","isoDate":"2025-02-07T13:34:53.000Z"},{"title":"Creators demand tech giants fess up and pay for all that AI training data","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/ai_training_data_committee/","pubDate":"2025-02-07T12:29:12.000Z","author":"Lindsay Clark","summary":"<h4>But 'original sin' has already been committed, shrugs industry</h4> <p>Governments are allowing AI developers to steal content – both creative and journalistic – for fear of upsetting the tech sector and damaging investment, a UK Parliamentary committee heard this week.…</p>","id":"tag:theregister.com,2005:story238366","isoDate":"2025-02-07T12:29:12.000Z"},{"title":"UK industry leaders unleash hurricane-grade scale for cyberattacks","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/uk_cyber_monitoring_centre/","pubDate":"2025-02-07T11:47:09.000Z","author":"Connor Jones","summary":"<h4>Freshly minted organization aims to take the guesswork out of incident severity for insurers and policy holders</h4> <p>A world-first organization assembled to categorize the severity of cybersecurity incidents is up and running in the UK following a year-long incubation period.…</p>","id":"tag:theregister.com,2005:story238403","isoDate":"2025-02-07T11:47:09.000Z"},{"title":"Musk's move fast and break things mantra won't work in US.gov","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/opinion_column_musk/","pubDate":"2025-02-07T10:27:14.000Z","author":"Steven J. Vaughan-Nichols","summary":"<h4>248-year-old democracy is not a tech startup</h4> <p><strong>Opinion</strong>  120-hour work weeks, firing government staffers and dismantling agencies? Oh my. The US government under pseudo President Musk is in for a world of radical change.…</p>","id":"tag:theregister.com,2005:story238368","isoDate":"2025-02-07T10:27:14.000Z"},{"title":"I was told to make backups, not test them. Why does that make you look so worried?","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/on_call/","pubDate":"2025-02-07T08:00:09.000Z","author":"Simon Sharwood","summary":"<h4>Shabby admin invented 'transparent tape' – a terrible storage medium but a magic tool for unlocking IT budgets</h4> <p><strong>On Call</strong>  Each week at work creates memories many are happy to forget, but some are willing to share with fellow <i>Register</i> readers in On Call, our Friday column that tells your tales of tech support.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238387","isoDate":"2025-02-07T08:00:09.000Z"},{"title":"Google's 7-year slog to improve Chrome extensions still hasn't satisfied developers","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/google_chrome_extensions/","pubDate":"2025-02-07T06:27:09.000Z","author":"Thomas Claburn","summary":"<h4>Makers of content blockers, privacy add-ons say promises weren't kept</h4> <p>Google's overhaul of Chrome's extension architecture continues to pose problems for developers of ad blockers, content filters, and privacy tools.…</p>","id":"tag:theregister.com,2005:story238399","isoDate":"2025-02-07T06:27:09.000Z"},{"title":"Hardware quality problems and server supply chain kinks slow Amazon’s $100 billion AI build","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/amazon_q4_fy_2024/","pubDate":"2025-02-07T04:59:12.000Z","author":"Simon Sharwood","summary":"<h4>Reverses life extensions for some servers it now feels aren’t useful in the inferencing age</h4> <p>Amazon Web Services is struggling to get the high-quality servers it needs to build AI infrastructure and has retired other hardware early to make room to accelerated machines.…</p>","id":"tag:theregister.com,2005:story238400","isoDate":"2025-02-07T04:59:12.000Z"},{"title":"Apple missed screenshot-snooping malware in code that made it into the App Store, Kaspersky claims","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/infected_apps_google_apple_stores/","pubDate":"2025-02-07T03:03:57.000Z","author":"Jessica Lyons","summary":"<h4>OCR plugin great for extracting crypto-wallet secrets from galleries</h4> <p>Kaspersky eggheads say they’ve spotted the first app containing hidden optical character recognition spyware in Apple’s App Store. Cunningly, the software nasty is designed to steal cryptocurrency.…</p>","id":"tag:theregister.com,2005:story238394","isoDate":"2025-02-07T03:03:57.000Z"},{"title":"If Ransomware Inc was a company, its 2024 results would be a horror show","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/ransomware_costs_analysis/","pubDate":"2025-02-07T01:50:53.000Z","author":"Iain Thomson","summary":"<h4>35% drop in payments across the year as your backups got better and law enforcement made a difference</h4> <p>Ransomware extortion payments fell in 2024, according to blockchain analyst biz Chainalysis this week.…</p>","id":"tag:theregister.com,2005:story238397","isoDate":"2025-02-07T01:50:53.000Z"},{"title":"DOGE geek with Treasury payment system access now quits amid racist tweet claims","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/07/doge_staffer_twitter/","pubDate":"2025-02-07T00:02:49.000Z","author":"Jessica Lyons","summary":"<h4>We did Nazi see that coming</h4> <p><strong>Updated</strong>  Marko Elez, a former SpaceX, Starlink, and X engineer who was granted deep access to a critical US Treasury payment system by the Trump-blessed Department of Government Efficiency (DOGE), has quit that team after he was linked to a racist Twitter account.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238398","isoDate":"2025-02-07T00:02:49.000Z"},{"title":"Amazon-backed X-energy bags $700M more for itty-bitty nuke reactors that don't exist yet","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/06/amazon_backed_xenergy_funding/","pubDate":"2025-02-06T23:03:49.000Z","author":"Brandon Vigliarolo","summary":"<h4>Looking forward to someone putting the new into nuclear</h4> <p>Months after Amazon joined a half-billion-dollar funding round for next-gen modular nuclear startup X-energy, the biz has announced a supplemental Series C-1 raise - despite its fission reactor design remaining unproven.…</p>","id":"tag:theregister.com,2005:story238396","isoDate":"2025-02-06T23:03:49.000Z"},{"title":"Coordinates of millions of smartphones feared stolen, sparking yet another lawsuit against data broker","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/06/gravy_analytics_data_breach_suit/","pubDate":"2025-02-06T22:07:06.000Z","author":"Thomas Claburn","summary":"<h4>Fourth time’s the harm?</h4> <p>Gravy Analytics has been sued yet again for allegedly failing to safeguard its vast stores of personal data, which are now feared stolen. And by personal data we mean information including the locations of tens of millions of smartphones, coordinates of which were ultimately harvested from installed apps.…</p>","id":"tag:theregister.com,2005:story238395","isoDate":"2025-02-06T22:07:06.000Z"}],"link":"https://www.theregister.com/","feedUrl":"https://www.theregister.com/headlines.atom","title":"The Register","lastBuildDate":"2025-02-11T11:01:06.00Z"}