{"items":[{"title":"Eight days later, Microsoft's native Outlook app on iOS devices still plagued","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/11/outlook_ios_problems/","pubDate":"2025-03-11T11:23:08.000Z","author":"Paul Kunert","summary":"<h4>Email client rises like a zombie, though its digital grave still marked by big red cross</h4> <p>The native Outlook email app for iOS users remains missing in action for some more than a week after users first reported service disruption, and Microsoft still hasn't confirmed the root cause.…</p>","id":"tag:theregister.com,2005:story238867","isoDate":"2025-03-11T11:23:08.000Z"},{"title":"Europe's largest council kept auditors in the dark on Oracle rollout fiasco for 10 months","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/11/birmingham_oracle_auditors/","pubDate":"2025-03-11T10:15:12.000Z","author":"Lindsay Clark","summary":"<h4>It took a whistleblower to expose disastrous ERP go-live</h4> <p>Birmingham City Council did not tell its official auditors about the disastrous Oracle implementation for ten months after the suite of applications went live, and appeared to obstruct access to the new system needed to complete their work.…</p>","id":"tag:theregister.com,2005:story238845","isoDate":"2025-03-11T10:15:12.000Z"},{"title":"Britain dusts off idle spectrum for rail and emergency comms","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/11/unused_spectrum_rail_esn/","pubDate":"2025-03-11T09:46:06.000Z","author":"Dan Robinson","summary":"<h4>1900 MHz band dormant since Y2K, but not available until 2029</h4> <p>Britain's telecoms regulator wants to repurpose unused mobile spectrum for the upcoming Emergency Services Network (ESN) and to overhaul communications in the railway sector.…</p>","id":"tag:theregister.com,2005:story238852","isoDate":"2025-03-11T09:46:06.000Z"},{"title":"MINJA sneak attack poisons AI models for other chatbot users","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/11/minja_attack_poisons_ai_model_memory/","pubDate":"2025-03-11T08:37:10.000Z","author":"Thomas Claburn","summary":"<h4>Nothing like an OpenAI-powered agent leaking data or getting confused over what someone else whispered to it</h4> <p>AI models with memory aim to enhance user interactions by recalling past engagements. However, this feature opens the door to manipulation.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238857","isoDate":"2025-03-11T08:37:10.000Z"},{"title":"IBM dodges BMC's $1.6B bullet in US as London court slaps down LzLabs","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/11/ibm_legal_victory/","pubDate":"2025-03-11T07:33:06.000Z","author":"Tobias Mann","summary":"<h4>Big Blue's legal eagles soar on both sides of the pond</h4> <p>IBM scored a pair of legal wins this week: The US Supreme Court declined to reinstate a $1.6 billion judgment previously awarded to BMC Software, and the High Court in London, England, ruled in favor of Big Blue in a lawsuit against LzLabs, which was accused of misappropriating IBM's mainframe technology.…</p>","id":"tag:theregister.com,2005:story238854","isoDate":"2025-03-11T07:33:06.000Z"},{"title":"Earth's atmosphere is shrinking and thinning, which is bad news for Starlink and other LEO Sats","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/11/greenhouse_gases_reduce_satellite_capacity_paper/","pubDate":"2025-03-11T06:27:10.000Z","author":"Simon Sharwood","summary":"<h4>The thermosphere usually drags space junk to its doom. As it thins, ruined orbits are a possibility</h4> <p>Earth's atmosphere is shrinking due to climate change and one of the possible negative impacts is that space junk will stay in orbit for longer, bonk into other bits of space junk, and make so much mess that low Earth orbits become less useful.…</p>","id":"tag:theregister.com,2005:story238864","isoDate":"2025-03-11T06:27:10.000Z"},{"title":"Oracle yet to sign a Stargate contract or predict revenue from AI mega-build","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/11/oracle_q3_2025/","pubDate":"2025-03-11T05:24:08.000Z","author":"Simon Sharwood","summary":"<h4>Guessed tax obligations wrong which helped to disappoint Wall Street even as sales boomed</h4> <p>Oracle on Monday announced customers committed to $48 billion of future cloud services consumption – just $5 billion less that its annual revenue for FY 2024 – but investors aren’t impressed.…</p>","id":"tag:theregister.com,2005:story238863","isoDate":"2025-03-11T05:24:08.000Z"},{"title":"Judge says Meta must defend claim it stripped copyright info from Llama's training fodder","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/11/meta_dmca_copyright_removal_case/","pubDate":"2025-03-11T02:59:43.000Z","author":"Thomas Claburn","summary":"<h4>Facebook giant allegedly didn't want neural networks to emit results that would give the game away</h4> <p>A judge has found Meta must answer a claim it allegedly removed so-called copyright management information from material used to train its AI models.…</p>","id":"tag:theregister.com,2005:story238861","isoDate":"2025-03-11T02:59:43.000Z"},{"title":"No peace for Gandi this past weekend, after storage SNAFU breaks email and more","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/11/gandi_domain_registrar_outage/","pubDate":"2025-03-11T00:12:21.000Z","author":"Iain Thomson","summary":"<h4>Oh, and Musk blames ‘Ukraine area’ for X downtime</h4> <p>Domain registrar, website host, and email provider Gandi.net suffered a major outage over the weekend. The latest update from the French biz, some 14 hours ago, stated it was \"still working on resolving all the issues,\" which we understand to mean it has largely fixed itself by now.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238860","isoDate":"2025-03-11T00:12:21.000Z"},{"title":"Allstate Insurance sued for delivering personal info on a platter, in plaintext, to anyone who went looking for it","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/allstate_sued_pii_exposure/","pubDate":"2025-03-10T23:11:56.000Z","author":"Jessica Lyons","summary":"<h4>Crooks built bots to exploit astoundingly bad quotation website and made off with data on thousands</h4> <p>New York State has sued Allstate Insurance for operating websites so badly designed they would deliver personal information in plain-text to anyone that went looking for it.…</p>","id":"tag:theregister.com,2005:story238858","isoDate":"2025-03-10T23:11:56.000Z"},{"title":"Google begs owners of crippled Chromecasts not to hit factory reset","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/google_chromecast_outage/","pubDate":"2025-03-10T20:28:56.000Z","author":"Iain Thomson","summary":"<h4>Expired SSL cert kerfuffle leaves second-gen, Audio gadgets useless</h4> <p>Google's second-generation Chromecast and its Chromecast Audio are suffering a major ongoing outage, with devices failing to cast due to an expired security certificate. The web giant is aware of the breakdown and says a fix is in the works.…</p>","id":"tag:theregister.com,2005:story238855","isoDate":"2025-03-10T20:28:56.000Z"},{"title":"Google's Chrome divorce still on the cards as Trump's DoJ plays hardball","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/trump_doj_google_chrome/","pubDate":"2025-03-10T17:07:14.000Z","author":"Brandon Vigliarolo","summary":"<h4>$1M donation to inauguration fund and a personal appearance by Pichai appear to have been pointless</h4> <p>If Google had hoped a bit of cosying up to President Trump would soften the US government's breakup demands in the wake of its search antitrust conviction, then it was seemingly mistaken.…</p>","id":"tag:theregister.com,2005:story238849","isoDate":"2025-03-10T17:07:14.000Z"},{"title":"Sidewinder goes nuclear, charts course for maritime mayhem in tactics shift","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/sidewinder_tactics_shift/","pubDate":"2025-03-10T16:01:11.000Z","author":"Connor Jones","summary":"<h4>Phishing and ancient vulns still do the trick for one of the most prolific groups around</h4> <p>Researchers say the Sidewinder offensive cyber crew is starting to target maritime and nuclear organizations.…</p>","id":"tag:theregister.com,2005:story238848","isoDate":"2025-03-10T16:01:11.000Z"},{"title":"ASML will open Beijing facility despite US sanctions on China","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/asml_to_open_beijing_facility/","pubDate":"2025-03-10T15:11:54.000Z","author":"Dan Robinson","summary":"<h4>Center will reuse and recondition systems returned from field</h4> <p><strong>Updated</strong>  Chipmaking tool biz ASML plans to open a new facility in China this year amid rising trade tensions between Washington and Beijing.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238847","isoDate":"2025-03-10T15:11:54.000Z"},{"title":"Rhysida pwns two US healthcare orgs, extracts over 300K patients' data","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/rhysida_healthcare/","pubDate":"2025-03-10T14:00:12.000Z","author":"Connor Jones","summary":"<h4>Terabytes of sensitive info remain available for download</h4> <p>Break-ins to systems hosting the data of two US healthcare organizations led to thieves making off with the personal and medical data of more than 300,000 patients.…</p>","id":"tag:theregister.com,2005:story238846","isoDate":"2025-03-10T14:00:12.000Z"},{"title":"Consumer Reports calls out slapdash AI voice-cloning safeguards","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/ai_voice_cloning_safeguards/","pubDate":"2025-03-10T13:15:09.000Z","author":"Thomas Claburn","summary":"<h4>Study finds 4 out of 6 providers don't do enough to stop impersonation</h4> <p>Four out of six companies offering AI voice cloning software fail to provide meaningful safeguards against the misuse of their products, according to research conducted by Consumer Reports.…</p>","id":"tag:theregister.com,2005:story238838","isoDate":"2025-03-10T13:15:09.000Z"},{"title":"How NOT to f-up your security incident response","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/incident_response_advice/","pubDate":"2025-03-10T12:42:19.000Z","author":"Jessica Lyons","summary":"<h4>Experts say that the way you handle things after the criminals break in can make things better or much, much worse</h4> <p><strong>Feature</strong>  Experiencing a ransomware infection or other security breach ranks among the worst days of anyone's life — but it can still get worse.…</p>","id":"tag:theregister.com,2005:story238839","isoDate":"2025-03-10T12:42:19.000Z"},{"title":"Vodafone: Be in the office 8 days a month or lose bonuses","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/vodafone_be_in_the_office_memo/","pubDate":"2025-03-10T11:45:08.000Z","author":"Paul Kunert","summary":"<h4>Staff warned that for Q1, non-compliance = 'Disciplinary action'</h4> <p><strong>Exclusive</strong>  Vodafone is warning staff in the UK to work onsite at least eight days a month or be subject to disciplinary action from April.…</p>","id":"tag:theregister.com,2005:story238835","isoDate":"2025-03-10T11:45:08.000Z"},{"title":"The NHS security culture problem is a crisis years in the making","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/nhs_security_culture/","pubDate":"2025-03-10T11:00:13.000Z","author":"Connor Jones","summary":"<h4>Insiders say board members must be held accountable and drive positive change from the top down</h4> <p><strong>Analysis</strong>  Walk into any hospital and ask the same question – \"Which security system should we invest in?\" – to both a doctor and a board member, and you may get different answers. The doctor chooses the system that leads to the most positive patient outcomes, while the board member chooses whichever solution is best for their increasingly stretched budget.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238832","isoDate":"2025-03-10T11:00:13.000Z"},{"title":"The IT world moves fast, so why are admins slow to upgrade?","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/database_upgrades_comment/","pubDate":"2025-03-10T10:15:16.000Z","author":"Richard Speed","summary":"<h4>Mission-critical app migration, 'if it ain't broke...' and more. All that glitters isn't gold when it comes to biz needs</h4> <p><strong>Comment</strong>  Administrators tend to be a conservative lot, which is bad news for tech vendors such as Microsoft that are seeking to pump their latest and greatest products into enterprises customers via subscriptions.…</p>","id":"tag:theregister.com,2005:story238829","isoDate":"2025-03-10T10:15:16.000Z"},{"title":"Things are looking down for cutting-edge cosmic observatories","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/neutrino_opinion/","pubDate":"2025-03-10T09:30:10.000Z","author":"Rupert Goodwins","summary":"<h4>Space is the place? Not if you're nuts about neutrinos</h4> <p><strong>Opinion</strong>  High energy neutrinos are the coolest particles in astrophysics. Born in distant cosmic cataclysms, they speed through the universe almost as if it wasn't there. With no charge and a truly tiny rest mass – perhaps a million times lighter than an electron, but who knows – they interact with virtually nothing.…</p>","id":"tag:theregister.com,2005:story238826","isoDate":"2025-03-10T09:30:10.000Z"},{"title":"Junior techie rushed off for fun weekend after making a terminal mistake that crashed a client","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/who_me/","pubDate":"2025-03-10T08:30:08.000Z","author":"Simon Sharwood","summary":"<h4>Using one green screen to manage multiple machines needs more than a Friday afternoon brain</h4> <p><strong>Who, Me?</strong>  Shifting focus from weekend fun to the reality of a return to work can be hard, so <i>The Register</i> tries to ease the transition with a fresh instalment of \"Who, Me?\", our reader-contributed column that tells your stories of making mistakes and making it out alive afterwards.…</p>","id":"tag:theregister.com,2005:story238822","isoDate":"2025-03-10T08:30:08.000Z"},{"title":"Strap in, get ready for more Rust drivers in Linux kernel","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/rust_drivers_expected_to_become/","pubDate":"2025-03-10T07:20:10.000Z","author":"Thomas Claburn","summary":"<h4>Likening memory safety bugs to smallpox may not soothe sensitive C coders</h4> <p>Rust is alive and well in the Linux kernel and is expected to translate into noticeable benefits shortly, though its integration with the largely C-oriented codebase still looks uneasy.…</p>","id":"tag:theregister.com,2005:story238841","isoDate":"2025-03-10T07:20:10.000Z"},{"title":"Manus mania is here: Chinese ‘general agent’ is this week’s ‘future of AI' and OpenAI-killer","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/manus_chinese_general_ai_agent/","pubDate":"2025-03-10T06:16:09.000Z","author":"Simon Sharwood","summary":"<h4>Prompts see it scour the web for info and turn it into decent documents at reasonable speed</h4> <p>Chinese researchers’ AI prowess is again a hot topic after a startup called Monica.im last week revealed “Manus”, a service it bills as a “general agent” that might improve on tools offered by Western companies.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238844","isoDate":"2025-03-10T06:16:09.000Z"},{"title":"$16B health dept managed finances with single Excel spreadsheet. It hasn’t gone well","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/nz_health_excel_spreadsheet/","pubDate":"2025-03-10T04:31:09.000Z","author":"Simon Sharwood","summary":"<h4>It's just one of 6,000 apps that New Zealand thinks might be best tamed with ERP</h4> <p>The body that runs New Zealand’s public health system uses a single Excel spreadsheet as the primary source of data to consolidate and manage its finances, which aren’t in great shape perhaps due to the sheet’s shortcomings.…</p>","id":"tag:theregister.com,2005:story238843","isoDate":"2025-03-10T04:31:09.000Z"},{"title":"Microsoft admits GitHub hosted malware that infected almost a million devices","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/10/infosec_in_brief/","pubDate":"2025-03-10T01:56:06.000Z","author":"Brandon Vigliarolo","summary":"<h4>Also, phone cleaner apps are a data-sucking scam, Singapore considering the literal rod for scammers, and more</h4> <p><strong>Infosec in Brief</strong>  Microsoft has spotted a malvertising campaign that downloaded nastyware hosted on GitHub and exposed nearly a million devices to information thieves.…</p>","id":"tag:theregister.com,2005:story238837","isoDate":"2025-03-10T01:56:06.000Z"},{"title":"India wants backdoors into clouds, email, SaaS, for tax inspectors","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/09/asia_tech_news_roundup/","pubDate":"2025-03-09T23:58:10.000Z","author":"Simon Sharwood","summary":"<h4>PLUS: Malaysia teams with Arm for local chip designs; NTT warns of possible breach; Samsung strikers settle; and more</h4> <p><strong>Asia in Brief</strong>  India’s government has proposed giving its tax authorities sweeping powers to access private email systems and applications.…</p>","id":"tag:theregister.com,2005:story238842","isoDate":"2025-03-09T23:58:10.000Z"},{"title":"eBPF. It doesn't stand for anything. But it might mean bank","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/09/ebpf_meta_servers/","pubDate":"2025-03-09T18:08:08.000Z","author":"Thomas Claburn","summary":"<h4>Meta says it cut CPU usage by 20% through kernel-level profiling. Just FYI</h4> <p>Meta says it has managed to reduce the CPU cycles of its top services by 20 percent through its Strobelight profiling orchestration suite, which relies on the open source eBPF project.…</p>","id":"tag:theregister.com,2005:story238818","isoDate":"2025-03-09T18:08:08.000Z"},{"title":"We call this kernel saunters: How Apple rearranged its XNU core with exclaves","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/08/kernel_sanders_apple_rearranges_xnu/","pubDate":"2025-03-08T16:07:06.000Z","author":"Thomas Claburn","summary":"<h4>iPhone giant compartmentalizes OS for the sake of security</h4> <p>Apple has been working to harden the XNU kernel that powers its various operating systems, including iOS and macOS, with a feature called \"exclaves.\"…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238791","isoDate":"2025-03-08T16:07:06.000Z"},{"title":"Surprise! People don't want AI deciding who gets a kidney transplant and who dies or endures years of misery","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/08/ai_kidney_transplant_moral_decisions/","pubDate":"2025-03-08T10:55:13.000Z","author":"Thomas Claburn","summary":"<h4>Researchers find AI isn't ready to help with moral decision making</h4> <p>Is AI an appropriate source of moral guidance about which patients should be given kidney transplants?…</p>","id":"tag:theregister.com,2005:story238814","isoDate":"2025-03-08T10:55:13.000Z"},{"title":"Stuff a Pi-hole in your router because your browser is about to betray you","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/08/pi_hole_6_flyby/","pubDate":"2025-03-08T09:30:07.000Z","author":"Liam Proven","summary":"<h4>Mozilla sells ads, Google limits blocking them – it's time for stricter measures</h4> <p>A new, lightweight version of Pi-Hole is here. Just how easy is it to block advertising on your home network?…</p>","id":"tag:theregister.com,2005:story238802","isoDate":"2025-03-08T09:30:07.000Z"},{"title":"Developer sabotaged ex-employer with kill switch activated when he was let go","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/08/developer_server_kill_switch/","pubDate":"2025-03-08T01:09:40.000Z","author":"Iain Thomson","summary":"<h4>IsDavisLuEnabledInActiveDirectory? Not any more. IsDavisLuGuilty? Yes. IsDavisLuFacingJail? Also yes</h4> <p>A federal jury in Cleveland has found a senior software developer guilty of sabotaging his employer's systems – and he's now facing a potential ten years behind bars.…</p>","id":"tag:theregister.com,2005:story238840","isoDate":"2025-03-08T01:09:40.000Z"},{"title":"Athena Moon lander officially FOADs – falls over and dies – in crater","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/athena_moon_probe_dies/","pubDate":"2025-03-07T22:10:56.000Z","author":"Iain Thomson","summary":"<h4>Second time unlucky for Intuitive Machines, but hey, at least we got 250MB of data from it</h4> <p>The Athena lander, which touched down on the Moon on Thursday and promptly fell over, has been declared dead by its operators.…</p>","id":"tag:theregister.com,2005:story238836","isoDate":"2025-03-07T22:10:56.000Z"},{"title":"Crypto takes a dip as Trump signs Bitcoin Reserve order","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/trump_signs_bitcoin_reserve_eo/","pubDate":"2025-03-07T20:36:12.000Z","author":"Brandon Vigliarolo","summary":"<h4>With no allowance to sell and little room to buy, and markets on the slide, it's UB40 time: Red, red, whine</h4> <p><strong>Comment</strong>  It's official: President Donald Trump signed an executive order Thursday to create a US Bitcoin reserve and stockpile of related digital assets, though instead of boosting the value of the coins, the market reacted negatively to the news.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238833","isoDate":"2025-03-07T20:36:12.000Z"},{"title":"Axiom Space and Red Hat to take edge computing into orbit","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/axiom_space_and_red_hat/","pubDate":"2025-03-07T19:28:15.000Z","author":"Richard Speed","summary":"<h4>To boldly go where HPE and Raspberry Pi have been for a while</h4> <p>Axiom Space plans to send a shoebox-sized node running Red Hat Device Edge to the International Space Station (ISS).…</p>","id":"tag:theregister.com,2005:story238808","isoDate":"2025-03-07T19:28:15.000Z"},{"title":"Uncle Sam charges alleged Garantex admins after crypto-exchange web seizures","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/uncle_sam_charges_2_garantex/","pubDate":"2025-03-07T18:53:07.000Z","author":"Jessica Lyons","summary":"<h4>$96B in transactions, some even labeled 'dirty funds,' since 2019, say prosecutors</h4> <p>The Feds today revealed more details about the US Secret Service-led Garantex takedown, a day after seizing websites and freezing assets belonging to the Russian cryptocurrency exchange in coordination with German and Finnish law enforcement agencies.…</p>","id":"tag:theregister.com,2005:story238834","isoDate":"2025-03-07T18:53:07.000Z"},{"title":"Quad goals: Meta proposes QLC SSDs as a new storage tier in datacenters","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/meta_proposes_qlc_ssds_as/","pubDate":"2025-03-07T18:33:14.000Z","author":"Dan Robinson","summary":"<h4>Trying to find a middle ground between spinning rust and performant TLC</h4> <p>Facebook parent Meta is exploring the use of QLC flash as an additional storage tier in its datacenters to address growing volumes of data as it juggles performance maintenance and energy efficiency.…</p>","id":"tag:theregister.com,2005:story238830","isoDate":"2025-03-07T18:33:14.000Z"},{"title":"Essential FOSS tools to make macOS suck less","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/fosss_to_tame_macos/","pubDate":"2025-03-07T17:33:10.000Z","author":"Liam Proven","summary":"<h4>Moved from Windows or Linux? Smooth some of the rough edges</h4> <p><strong>Friday FOSS fest</strong>  There are some idiosyncrasies about macOS that long term Mac users may never notice, but cause frustration in people more used to how Windows does things – or the much more customizable Linux desktop experience. Here are a few of <em>The Reg</em> FOSS desk's favorite tools we routinely install on new machines to make life a little more comfortable or convenient.…</p>","id":"tag:theregister.com,2005:story238811","isoDate":"2025-03-07T17:33:10.000Z"},{"title":"Oracle outage hits US Federal health records systems","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/oracle_outage_federal_health_records/","pubDate":"2025-03-07T16:21:14.000Z","author":"Lindsay Clark","summary":"<h4>Big Red pushes restart button after users locked out of apps across Veterans Affairs hospitals, other govt departments</h4> <p>Oracle's Federal electronic health records software suffered a US-wide outage this week, causing Veterans Affairs hospitals to invoke \"standard contingency procedures.\"…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238828","isoDate":"2025-03-07T16:21:14.000Z"},{"title":"Alleged cyber scalpers Swiftly cuffed over $635K Taylor ticket heist","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/stubhub_taylor_swift_scammers/","pubDate":"2025-03-07T15:28:12.000Z","author":"Connor Jones","summary":"<h4>I knew you were trouble, Queens DA might have said</h4> <p>Police have made two arrests in their quest to start a cybercrime crew's prison eras, alleging the pair stole hundreds of Taylor Swift tickets and sold them for huge profit. …</p>","id":"tag:theregister.com,2005:story238824","isoDate":"2025-03-07T15:28:12.000Z"},{"title":"Cheap 'n' simple sign trickery will bamboozle self-driving cars, fresh research claims","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/lowcost_malicious_attacks_on_selfdriving/","pubDate":"2025-03-07T14:32:14.000Z","author":"Lindsay Clark","summary":"<h4>Now that's sticker shock</h4> <p>Eggheads have taken a look at previously developed techniques that can be used to trick self-driving cars into doing the wrong thing – and found cheap stickers stuck on stop and speed limit signs, at least, are pretty effective.…</p>","id":"tag:theregister.com,2005:story238785","isoDate":"2025-03-07T14:32:14.000Z"},{"title":"HPE revenue outlook feels the thump of Trump tariffs","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/hpe_q1_2025/","pubDate":"2025-03-07T13:34:09.000Z","author":"Dan Robinson","summary":"<h4>Thousands brace for layoffs as shares slide 20%</h4> <p>HPE is feeling the effects of the Trump administration's gamesmanship, seeing shares slide after lowering earnings expectations due to uncertainty over how tariffs may affect the cost of imported parts.…</p>","id":"tag:theregister.com,2005:story238825","isoDate":"2025-03-07T13:34:09.000Z"},{"title":"Microsoft tells abandoned Publisher fans to just use Word and hope for the best","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/microsoft_publisher_eol/","pubDate":"2025-03-07T12:25:13.000Z","author":"Richard Speed","summary":"<h4>PDFs and Powerpoint also lie in wait as 2026 looms</h4> <p>Microsoft is suggesting alternatives to its doomed Publisher product ahead of the software's demise in 2026.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238823","isoDate":"2025-03-07T12:25:13.000Z"},{"title":"Like whitebox servers, rent-a-crew crime 'affiliates' have commoditized ransomware","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/commoditization_ransomware/","pubDate":"2025-03-07T11:31:11.000Z","author":"Jessica Lyons","summary":"<h4>Which is why taking down chiefs and infra behind big name brand operations isn't working</h4> <p><strong>Interview</strong>  There's a handful of cybercriminal gangs that Jason Baker, a ransomware negotiator with GuidePoint Security, regularly gets called in to respond to these days, and a year ago only one of these crews — Akira — was on threat hunters' radars and infecting organizations with the same ferocity as it is today.…</p>","id":"tag:theregister.com,2005:story238810","isoDate":"2025-03-07T11:31:11.000Z"},{"title":"Eutelsat in talks with Euro leaders as they mull Starlink replacement in Ukraine","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/eutelsat_starlink_ukraine/","pubDate":"2025-03-07T10:27:10.000Z","author":"Richard Speed","summary":"<h4>Increasingly shaky relationship with the States has Europe considering options</h4> <p>Talks are underway between European leaders and Eutelsat about a possible replacement for Starlink in Ukraine.…</p>","id":"tag:theregister.com,2005:story238805","isoDate":"2025-03-07T10:27:10.000Z"},{"title":"Troubled French outsourcer Atos finds pot of gold at the end of UK state bank Rainbow","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/troubled_french_outsourcer_atos_finds/","pubDate":"2025-03-07T09:30:06.000Z","author":"Lindsay Clark","summary":"<h4>Difficulties unpicking 25 years of technical entanglement secure £474.4M without competition</h4> <p><strong>Updated</strong>  Following protracted negotiations, French outsourcer Atos has scooped up a £474.4 million ($612 million) contract without competition to build systems for a UK state bank at nearly three times the annual rate initially advertised three years ago.…</p>","id":"tag:theregister.com,2005:story238803","isoDate":"2025-03-07T09:30:06.000Z"},{"title":"Glitchy taxi tech blew cover on steamy dispatch dalliance","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/on_call/","pubDate":"2025-03-07T08:30:07.000Z","author":"Simon Sharwood","summary":"<h4>When 'pickup' means more than just a ride</h4> <p><strong>On Call</strong>  The week has ebbed away with embarrassing speed, so here we are again with a fresh installment of On Call, <i>The Register's</i> reader-contributed column that immortalizes tech support stories.…</p>","id":"tag:theregister.com,2005:story238797","isoDate":"2025-03-07T08:30:07.000Z"},{"title":"Do you DARE? Europe bets once again on RISC-V for supercomputing sovereignty","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/dare_europe_risc_v_project/","pubDate":"2025-03-07T07:38:07.000Z","author":"Tobias Mann","summary":"<h4>€240M found for three-year sprint to develop three chiplets for HPC, AI</h4> <p>A 38-strong group of tech players have founded a project with the snappy name Digital Autonomy with RISC-V in Europe, aka DARE, that aims to develop processor units to power the continent’s supercomputers and other high-performance machines.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238815","isoDate":"2025-03-07T07:38:07.000Z"},{"title":"SpaceX's 'Days Since Starship Exploded' counter made it to 48. It's back to zero again now","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/spacex_starship_mission_fail/","pubDate":"2025-03-07T06:32:13.000Z","author":"Simon Sharwood","summary":"<h4>'Energetic event' did for Flight 8 after a few minutes. Super Heavy Booster recovered again, so there's that</h4> <p>SpaceX's latest attempt to fly its Starship has again ended in a rapid unscheduled disassembly.…</p>","id":"tag:theregister.com,2005:story238821","isoDate":"2025-03-07T06:32:13.000Z"},{"title":"Broadcom has won. 70 percent of large VMware customers bought its biggest bundle","link":"https://go.theregister.com/feed/www.theregister.com/2025/03/07/broadcom_q1_fy2025/","pubDate":"2025-03-07T05:35:07.000Z","author":"Simon Sharwood","summary":"<h4>Now working with seven hyperscalers for custom AI silicon. Not working on acquiring bits of Intel</h4> <p>Broadcom’s acquisition of VMware appears to be a big success, on the balance sheet at least, after the company announced a big majority of its top 10,000 customers have decided to acquire its Cloud Foundation stack and posted strong growth.…</p>","id":"tag:theregister.com,2005:story238820","isoDate":"2025-03-07T05:35:07.000Z"}],"link":"https://www.theregister.com/","feedUrl":"https://www.theregister.com/headlines.atom","title":"The Register","lastBuildDate":"2025-03-11T11:23:08.00Z"}