{"items":[{"title":"Abandoned AWS S3 buckets can be reused in supply-chain attacks that would make SolarWinds look 'insignificant'","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/04/abandoned_aws_s3/","pubDate":"2025-02-04T11:00:06.000Z","author":"Jessica Lyons","summary":"<h4>When cloud customers don't clean up after themselves, part 97</h4> <p>Abandoned AWS S3 buckets could be reused to hijack the global software supply chain in an attack that would make Russia's \"SolarWinds adventures look amateurish and insignificant,\" watchTowr Labs security researchers have claimed.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238337","isoDate":"2025-02-04T11:00:06.000Z"},{"title":"Amazon's Kuiper secures license to take on Starlink in the UK","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/04/ofcom_amazon_kuiper_license/","pubDate":"2025-02-04T10:16:14.000Z","author":"Richard Speed","summary":"<h4>Everybody is going to play nice, OK?</h4> <p>Telecom watchdog Ofcom has granted a license application from Amazon Kuiper Services Europe for satellite connectivity in the UK.…</p>","id":"tag:theregister.com,2005:story238326","isoDate":"2025-02-04T10:16:14.000Z"},{"title":"UK govt must learn fast and let failing projects die young","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/04/ukgov_must_embrace_a_fastlearning/","pubDate":"2025-02-04T09:30:08.000Z","author":"Lindsay Clark","summary":"<h4>Tackle longstanding issues around productivity, cyber resilience and public sector culture, advises spending watchdog</h4> <p>The UK's government spending watchdog has called on the current administration to make better use of technology to kickstart the misfiring economy and ensure better delivery public services amid tightened budgets.…</p>","id":"tag:theregister.com,2005:story238325","isoDate":"2025-02-04T09:30:08.000Z"},{"title":"Google patches odd Android kernel security bug amid signs of targeted exploitation","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/04/google_android_patch_netgear/","pubDate":"2025-02-04T08:18:11.000Z","author":"Iain Thomson","summary":"<h4>Also, Netgear fixes critical router, access point vulnerabilities</h4> <p>Google has released its February Android security updates, including a fix for a high-severity kernel-level vulnerability, which is suspected to be in use by targeted exploits.…</p>","id":"tag:theregister.com,2005:story238336","isoDate":"2025-02-04T08:18:11.000Z"},{"title":"Not even Nvidia's Jensen Huang can talk President Tariffs out of chip import taxes","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/04/nvidia_trump_tariffs/","pubDate":"2025-02-04T01:04:11.000Z","author":"Tobias Mann","summary":"<h4>GPU giant could just wait eight minutes for Donald to change his mind</h4> <p>US President Donald Trump loves his tariffs and it seems that not even a meeting with Nvidia CEO Jensen Huang could persuade him to change course.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238335","isoDate":"2025-02-04T01:04:11.000Z"},{"title":"Musk’s DOGE ship gets ‘full’ access to Treasury payment system, sinks USAID","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/musk_doge_treasury_usaid/","pubDate":"2025-02-03T23:31:49.000Z","author":"Jessica Lyons","summary":"<h4>Who better to trust trillions of dollars, SSNs and other sensitive info with than Elon</h4> <p>The chaos in Washington DC continued over the weekend and into Monday with government workers locked out of their offices and Elon Musk's Department of Government Efficiency (DOGE) getting unfettered access to classified materials and a top government payment system.…</p>","id":"tag:theregister.com,2005:story238334","isoDate":"2025-02-03T23:31:49.000Z"},{"title":"US senator wants to slap prison term, $1M fine on anyone aiding Chinese AI with ... downloads?","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/us_senator_download_chinese_ai_model/","pubDate":"2025-02-03T22:58:09.000Z","author":"Tobias Mann","summary":"<h4>As UK proposes laws against neural-nets-for-pedophiles</h4> <p>Americans may have to think twice about downloading a Chinese AI model or investing in a company behind such a neural network in future. A law proposed last month by Senator Josh Hawley (R-MO), if successfully passed by Congress, would impose penalties of up to 20 years in prison or $1 million in fines for violating its restrictions on AI-related trade and collaboration.…</p>","id":"tag:theregister.com,2005:story238330","isoDate":"2025-02-03T22:58:09.000Z"},{"title":"TSA’s airport facial-recog tech faces audit probe","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/tsa_facial_recognition_audit/","pubDate":"2025-02-03T22:30:11.000Z","author":"Brandon Vigliarolo","summary":"<h4>Senators ask, Homeland Security watchdog answers: Is it worth the money?</h4> <p>The Department of Homeland Security's Inspector General has launched an audit of the Transportation Security Administration's use of facial recognition technology at US airports, following criticism from lawmakers and privacy advocates.…</p>","id":"tag:theregister.com,2005:story238332","isoDate":"2025-02-03T22:30:11.000Z"},{"title":"Trump scrubs all mention of DEI, gender, climate change from federal websites","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/trump_admin_scrubs_dei_websites/","pubDate":"2025-02-03T21:30:13.000Z","author":"Thomas Claburn","summary":"<h4>Meanwhile, the Internet Archive races to save what it can – again</h4> <p>Vast numbers of webpages have disappeared from federal sites in an effort to meet the deadline to implement the Trump administration's executive orders targeting diversity initiatives and gender.…</p>","id":"tag:theregister.com,2005:story238333","isoDate":"2025-02-03T21:30:13.000Z"},{"title":"Ontario responds to Trump tariff by pitching Starlink deal into the trash","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/ontario_canada_responds_to_trump_tariff/","pubDate":"2025-02-03T20:15:12.000Z","author":"Brandon Vigliarolo","summary":"<h4>Canadian province 'won't do business with people hellbent on destroying our economy'</h4> <p><strong>Updated</strong>  The provincial government in Ontario, Canada is hitting back at President Trump's 25 percent tariffs on the US' northern neighbor by scrapping a deal with Elon Musk's Starlink.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238331","isoDate":"2025-02-03T20:15:12.000Z"},{"title":"Microsoft to kill off Defender VPN this month","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/microsoft_defender_vpn_killed_off/","pubDate":"2025-02-03T19:15:12.000Z","author":"Iain Thomson","summary":"<h4>Throw Copilot down the same well, too, maybe? No? OK</h4> <p>If you were relying on Microsoft's Defender VPN, it's time to find an alternative - Redmond is shutting it down at the end of the month.…</p>","id":"tag:theregister.com,2005:story238329","isoDate":"2025-02-03T19:15:12.000Z"},{"title":"Intel rakes in €515M from EU after ancient antitrust fine nixed","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/intel_eu_antitrust_payout/","pubDate":"2025-02-03T17:37:11.000Z","author":"Dan Robinson","summary":"<h4>A glimmer of light in an otherwise gloomy year for troubled chipmaker</h4> <p>Beleaguered chip giant Intel has at least one thing to smile about after receiving a payout of €515.55 million ($536 million) from the EU in relation to an old antitrust case that it challenged.…</p>","id":"tag:theregister.com,2005:story238327","isoDate":"2025-02-03T17:37:11.000Z"},{"title":"Call of Duty studio co-founder pleads guilty to crashing drone into firefighting aircraft","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/call_of_duty_founder_drone_crash/","pubDate":"2025-02-03T16:53:09.000Z","author":"Brandon Vigliarolo","summary":"<h4>Peter Tripp Akemann avoids jail, will pay 'Super Scooper' repair costs and is ordered to help with LA's wildfire recovery</h4> <p>A Culver City, California resident has admitted to crashing his drone into a 'Super Scooper' firefighting aircraft battling the Los Angeles wildfires. His guilty plea spares him up to a year in prison, according to the Department of Justice.…</p>","id":"tag:theregister.com,2005:story238324","isoDate":"2025-02-03T16:53:09.000Z"},{"title":"OpenAI unveils deep research agent for ChatGPT","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/openai_unveils_deep_research_agent/","pubDate":"2025-02-03T15:30:15.000Z","author":"Richard Speed","summary":"<h4>Takes a bit more time to spout a bit less nonsense</h4> <p>OpenAI today launched deep research in ChatGPT, a new agent that takes a little longer to perform a deeper dive into the web to come up with a response to a query.…</p>","id":"tag:theregister.com,2005:story238321","isoDate":"2025-02-03T15:30:15.000Z"},{"title":"Lightsail space tech gets tailwind from Caltech breakthrough","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/light_sails_tech_paper/","pubDate":"2025-02-03T15:11:59.000Z","author":"Lindsay Clark","summary":"<h4>Sci-fi interstellar travel gets another tiny push</h4> <p>Centuries after Western explorers used sail power to discover a world hitherto unknown to them — although well known to people who already lived there — science fiction writers and engineers have wondered if space exploration might be similarly powered by lightsails.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238323","isoDate":"2025-02-03T15:11:59.000Z"},{"title":"US datacenters in for shock as Canada mulls cutting the juice over Trump tariffs","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/datacenters_canada_trump_tariffs/","pubDate":"2025-02-03T14:09:58.000Z","author":"Dan Robinson","summary":"<h4>Short-term result likely to be increased energy prices across the board</h4> <p><strong>Updated</strong>  Trump's tariffs are raising a new question mark over US datacenters and their expanding energy consumption, with price hikes possible as Canada threatens to withhold energy supplies in response.…</p>","id":"tag:theregister.com,2005:story238322","isoDate":"2025-02-03T14:09:58.000Z"},{"title":"DeepSeek spills Big AI's open secret: Bright people with good ideas can beat billion dollar binges","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/opinion_column_deepseek/","pubDate":"2025-02-03T13:15:11.000Z","author":"Rupert Goodwins","summary":"<h4>You can’t make monopoly money without a monopoly, but you sure can lose it</h4> <p><strong>Opinion</strong>  It would take a heart of stone not to explode with joy at the massive infusion of schadenfreude provided in recent days by the DeepSeek AIpocalypse.…</p>","id":"tag:theregister.com,2005:story238295","isoDate":"2025-02-03T13:15:11.000Z"},{"title":"FuriPhone FLX1: A Debian-powered brick that puts GNOME in your back pocket","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/furiphone_flx1/","pubDate":"2025-02-03T12:30:12.000Z","author":"Liam Proven","summary":"<h4>Fun with a FOSS-focused Phosh fondleslab</h4> <p>FuriLabs offers a decent-spec smartphone that is based on Debian and can run GNOME apps in your pocket.…</p>","id":"tag:theregister.com,2005:story238240","isoDate":"2025-02-03T12:30:12.000Z"},{"title":"2 officers bailed as anti-corruption unit probes data payouts to N Irish cops","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/two_psni_officers_arrested_bailed/","pubDate":"2025-02-03T11:46:06.000Z","author":"Connor Jones","summary":"<h4>Investigating compensation to police whose sensitive info was leaked in 2023</h4> <p>The Police Service of Northern Ireland (PSNI) has bailed two officers after they were arrested as part of a fraud investigation related to the payments to cops whose sensitive data was mistakenly published in 2023.…</p>","id":"tag:theregister.com,2005:story238320","isoDate":"2025-02-03T11:46:06.000Z"},{"title":"Motorola appeal over £200M price cap for Airwave service rejected","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/motorola_reaches_end_of_road/","pubDate":"2025-02-03T11:01:14.000Z","author":"Dan Robinson","summary":"<h4>Profiteering from emergency services comms network in Britain? Not anymore, says CMA</h4> <p>Motorola will not be allowed to again appeal a decision by the UK competition regulator to impose a price cap on the communications network it operates for Britain's emergency services.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238305","isoDate":"2025-02-03T11:01:14.000Z"},{"title":"Mega city council's Oracle finance fix faces further delays","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/birmingham_city_council_oracle/","pubDate":"2025-02-03T10:15:07.000Z","author":"Lindsay Clark","summary":"<h4>Third-party software sticking plaster expected six months late</h4> <p>Further delays have hit Birmingham City Council's disastrous attempt to implement a functioning finance system after it emerged that off-the-shelf software to solve \"one of the fundamental problems\" with the beleaguered Oracle implementation has been put back.…</p>","id":"tag:theregister.com,2005:story238299","isoDate":"2025-02-03T10:15:07.000Z"},{"title":"UK biz dept overspent by £208M prepping to pay workers hurt in Post Office IT scandal","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/uk_government_department_exceeds_spending/","pubDate":"2025-02-03T09:30:12.000Z","author":"Lindsay Clark","summary":"<h4>Auditor offers qualified opinion as financial fallout from historic miscarriage of justice remains unclear</h4> <p><strong>Updated</strong>  The UK's spending watchdog has offered a \"qualified opinion\" on the Department for Business and Trade's accounts, largely down to uncertainties around a scheme designed to mitigate the historic injustice surrounding the Post Office Horizon IT scandal.…</p>","id":"tag:theregister.com,2005:story238303","isoDate":"2025-02-03T09:30:12.000Z"},{"title":"CompSci teacher sets lab task: Accidentally breaking the university","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/who_me/","pubDate":"2025-02-03T07:58:11.000Z","author":"Simon Sharwood","summary":"<h4>Hey! Teacher! Leave our network alone!</h4> <p><strong>Who, Me?</strong>  At the start of working week, it can sometimes feel like you’re just another brick in the wall and the next five days will require you to carry weight for others. To ease you into the mucky business of exchanging your labor for currency, <i>The Register</i> therefore uses each Monday to offer a fresh instalment of Who, Me? It’s the column in which you admit to escaping your errors and emerging unscathed.…</p>","id":"tag:theregister.com,2005:story238318","isoDate":"2025-02-03T07:58:11.000Z"},{"title":"Privacy Commissioner warns the ‘John Smiths’ of the world can acquire ‘digital doppelgangers’","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/australia_digital_doppelgangers_privacy_award/","pubDate":"2025-02-03T06:30:13.000Z","author":"Simon Sharwood","summary":"<h4>Australian government staff mixed medical info for folk who share names and birthdays</h4> <p>Australia’s privacy commissioner has found that government agencies down under didn’t make enough of an effort to protect data describing “digital doppelgangers” – people who share a name and date of birth and whose government records sometimes contain data describing other people.…</p>","id":"tag:theregister.com,2005:story238317","isoDate":"2025-02-03T06:30:13.000Z"},{"title":"As Trump slugs Canada, Mexico and China with tariffs, industry groups hope trade war weapon isn’t pointed at their feet","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/us_tariff_analysis/","pubDate":"2025-02-03T04:29:13.000Z","author":"Simon Sharwood","summary":"<h4>Tech lobby isn't at the negotiating table, fears unintended consequences</h4> <p><strong>Updated</strong>  US President Donald Trump has delivered on his campaign promise to introduce tariffs, by slapping a 25 percent duty on imports from Canada and Mexico, and an extra ten percent impost on goods from China. Industry groups quickly responded by saying this is not a great idea.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238316","isoDate":"2025-02-03T04:29:13.000Z"},{"title":"Medical monitoring machines spotted stealing patient data, users warned to pull the plug ASAP","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/backdoored_contec_patient_monitors_leak_data/","pubDate":"2025-02-03T02:02:06.000Z","author":"Brandon Vigliarolo","summary":"<h4>PLUS: MGM settles breach suits; AWS doesn't trust you with security defaults; A new .NET backdoor; and more</h4> <p><strong>Infosec in brief</strong>  The United States Food and Drug Administration has told medical facilities and caregivers that monitor patients using Contec equipment to disconnect the devices from the internet ASAP.…</p>","id":"tag:theregister.com,2005:story238309","isoDate":"2025-02-03T02:02:06.000Z"},{"title":"Singapore says Nvidia's astounding local sales don't mean it's the source of DeepSeek's GPUs","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/03/asia_tech_news_in_brief/","pubDate":"2025-02-03T00:31:12.000Z","author":"Simon Sharwood","summary":"<h4>PLUS: Chinese bus lanes put Tesla in a tangle; India drops electronics tariffs; Samsung worries about soft demand</h4> <p><strong>Asia In Brief</strong>  Nvidia’s quarterly results occasionally raise eyebrows because they report that Singapore is a disproportionately large market for its wares. In a Q3 2025 <a target=\"_blank\" rel=\"nofollow\" href=\"https://s201.q4cdn.com/141608511/files/doc_financials/2025/q3/ed2a395c-5e9b-4411-8b4a-a718d192155a.pdf\">filing</a> [PDF], for example, the accelerator colossus revealed that Singapore is its second-largest market and accounted for 22 percent of revenue.…</p>","id":"tag:theregister.com,2005:story238315","isoDate":"2025-02-03T00:31:12.000Z"},{"title":"Humans brought the heat. Earth says we pay the price","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/02/heatwaves_future/","pubDate":"2025-02-02T20:04:12.000Z","author":"Rik Myslewski","summary":"<h4>Amid wildfire death and destruction, there are solutions, workable smart solutions, but who wants to talk about that?</h4> <p><strong>Special report</strong>  We humans have gorged ourselves on fossil fuels for well over a century, and the bill for that delicious, civilization-enhancing meal has finally come due.…</p>","id":"tag:theregister.com,2005:story238268","isoDate":"2025-02-02T20:04:12.000Z"},{"title":"What does it mean to build in security from the ground up?","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/02/security_design_choices/","pubDate":"2025-02-02T17:26:08.000Z","author":"Larry Peterson","summary":"<h4>As if secure design is the only bullet point in a list of software engineering best practices</h4> <p><strong>Systems Approach</strong>  As my Systems Approach co-author Bruce Davie and I think through what it means to apply the systems lens to security, I find that I keep asking myself what it is, exactly, that’s unique about security as a system requirement?…</p>","id":"tag:theregister.com,2005:story238314","isoDate":"2025-02-02T17:26:08.000Z"},{"title":"Gilmore Girls fans nabbed as Eurocops dismantle two major cybercrime forums","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/02/eurocops_takedown_cybercrime/","pubDate":"2025-02-02T13:19:07.000Z","author":"Connor Jones","summary":"<h4>Nulled and Cracked had a Lorelai-cal rise - until Operation Talent stepped in</h4> <p>Law enforcement officers across Europe assembled again to collectively disrupt major facilitators of cybercrime, with at least one of those cuffed apparently a fan of the dramedy series <em>The Gilmore Girls</em>.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238302","isoDate":"2025-02-02T13:19:07.000Z"},{"title":"Microsoft vet laments a world where even toothbrushes need reboots","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/02/raymond_chen_restarts_updates/","pubDate":"2025-02-02T09:31:07.000Z","author":"Richard Speed","summary":"<h4>Raymond Chen reflects on the never-ending cycle of updates and restarts</h4> <p><strong>Comment</strong>  Remember when things didn't need constant updating and reboots to work? Veteran Microsoft engineer Raymond Chen notes that the affliction has even spread as far as the humble electric toothbrush.…</p>","id":"tag:theregister.com,2005:story238254","isoDate":"2025-02-02T09:31:07.000Z"},{"title":"Intel has officially missed the boat for AI in the datacenter","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/01/intel_ai_datacenter/","pubDate":"2025-02-01T15:03:10.000Z","author":"Tobias Mann","summary":"<h4>But it still has a chance at the network edge and the PC</h4> <p><strong>Comment</strong>  Any hope Intel may have had of challenging rivals Nvidia and AMD for a slice of the AI accelerator market dissolved on Thursday as yet another GPU architecture was scrapped.…</p>","id":"tag:theregister.com,2005:story238312","isoDate":"2025-02-01T15:03:10.000Z"},{"title":"DeepSeek or DeepFake? Our vultures circle China's hottest AI","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/01/deepseek_kettle_ai/","pubDate":"2025-02-01T11:34:12.000Z","author":"Iain Thomson","summary":"<h4>If this keeps Silicon Valley on its toes and honest, who are we to complain?</h4> <p><strong>Kettle</strong>  There's really only one topic for the Kettle this week. DeepSeek.…</p>","id":"tag:theregister.com,2005:story238307","isoDate":"2025-02-01T11:34:12.000Z"},{"title":"Windows 11 stages a comeback – still miles behind older sibling","link":"https://go.theregister.com/feed/www.theregister.com/2025/02/01/windows_11_statcounter/","pubDate":"2025-02-01T09:32:06.000Z","author":"Richard Speed","summary":"<h4>Microsoft's latest OS claws back market share from Windows 10, but the finish line is a long way off</h4> <p>Microsoft appears to be starting the year with a rebound in Windows 11 adoption as the latest figures show the operating system reversing its recent months' long declines.…</p>","id":"tag:theregister.com,2005:story238304","isoDate":"2025-02-01T09:32:06.000Z"},{"title":"Dell ends hybrid work policy, demands return-to-office despite remote work pledge","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/dell_ends_hybrid_work_policy/","pubDate":"2025-01-31T23:09:06.000Z","author":"Thomas Claburn","summary":"<h4>That email chain could have been a 30-second chit-chat, says IT giant</h4> <p>Dell Technologies intends to end its hybrid work arrangement in March, requiring those previously allowed to toil from home part-time to spend their entire five-day work week within corporate walls.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238311","isoDate":"2025-01-31T23:09:06.000Z"},{"title":"You begged Microsoft to be reasonable. Instead it made Copilot reason-able with OpenAI GPT-o1","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/microsoft_open_ai_reasoning_copilot/","pubDate":"2025-01-31T21:44:37.000Z","author":"Thomas Claburn","summary":"<h4>'Magical free' upgrade coincidentally follows M365 price hike</h4> <p>Microsoft has made Think Deeper, OpenAI's GPT-o1 reasoning model, \"free and available for all users of Copilot.\"…</p>","id":"tag:theregister.com,2005:story238308","isoDate":"2025-01-31T21:44:37.000Z"},{"title":"Trump’s tariffs, cuts may well put tech in a chokehold, say analysts","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/trump_policies_painting_global_tech/","pubDate":"2025-01-31T19:18:43.000Z","author":"Brandon Vigliarolo","summary":"<h4>Forrester's take on President's economic agenda offers little optimism for the industry</h4> <p>It's been less than two weeks since Donald Trump returned to the White House, and the effect the administration may have on the global tech industry is still far from clear. …</p>","id":"tag:theregister.com,2005:story238306","isoDate":"2025-01-31T19:18:43.000Z"},{"title":"You're going to do <em>what</em> to the feature? Microsoft defines what it means by 'deprecation'","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/microsoft_defines_what_it_means/","pubDate":"2025-01-31T16:30:12.000Z","author":"Richard Speed","summary":"<h4>Self-deprecation much less fun if you're not joking... or if nobody knows what the heck you mean</h4> <p>Microsoft has explained what it means by \"deprecation\" – it doesn't mean \"the end\", it means \"save the date.\"…</p>","id":"tag:theregister.com,2005:story238300","isoDate":"2025-01-31T16:30:12.000Z"},{"title":"DeepSeek means companies need to consider AI investment more carefully","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/deepseek_implications/","pubDate":"2025-01-31T15:33:11.000Z","author":"Dan Robinson","summary":"<h4>But Chinese startup shakeup doesn't herald 'drastic drop' in need for infrastructure buildout, say analysts</h4> <p><strong>Analysis</strong>  The shockwave following the release of competitive AI models from Chinese startup DeepSeek has led many to question the assumption that throwing ever more money at costly large-scale GPU-based infrastructure delivers the best results.…</p>","id":"tag:theregister.com,2005:story238301","isoDate":"2025-01-31T15:33:11.000Z"},{"title":"'Abandoned' astro takes recordbreaking ninth spacewalk","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/abandoned_astro_takes_recordbreaking_ninth/","pubDate":"2025-01-31T14:01:10.000Z","author":"Richard Speed","summary":"<h4>Sunita Williams lays claim to lead for female EVAs</h4> <p>NASA 'naut Sunita Williams has broken Peggy Whitson's record for total spacewalking time for a female astronaut with a trip outside the International Space Station (ISS) to collect samples from the outpost's exterior.…</p>","id":"tag:theregister.com,2005:story238298","isoDate":"2025-01-31T14:01:10.000Z"},{"title":"IBM banks on friendlier US regulatory climate for dealmaking","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/ibm_banks_on_friendlier_us/","pubDate":"2025-01-31T12:45:16.000Z","author":"Paul Kunert","summary":"<h4>Reckons completion of Hashicorp buy is around the corner, plans to use some of $7B free cash for more M&amp;A</h4> <p>IBM is hopeful of completing the $6.4 billion purchase of Hashicorp relatively smoothly given what Big Blue perceives to be a \"more rational\" and \"pro-competition\" regulatory environment.…</p>","id":"tag:theregister.com,2005:story238292","isoDate":"2025-01-31T12:45:16.000Z"},{"title":"Welsh woman fined for flatulence-fueled cyber harassment","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/wales_flatulence_harassment/","pubDate":"2025-01-31T11:50:07.000Z","author":"Connor Jones","summary":"<h4>Court said her approach to child access dispute with partner's ex really stinks</h4> <p>Wales has given the world many things – Tom Jones, laverbread, and the equals sign. But one woman from Caernarfon has added weaponized flatulence to the list. Her unorthodox approach to WhatsApp landed her with a community order and fines.…</p>","id":"tag:theregister.com,2005:story238297","isoDate":"2025-01-31T11:50:07.000Z"},{"title":"BT fiber rollout passes 17 million homes, altnet challenge grows","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/bt_fiber_rollout_passes_17/","pubDate":"2025-01-31T11:12:37.000Z","author":"Dan Robinson","summary":"<h4>Only 35% of those premises actually hooked up though, plus company reports 'higher competitor losses'</h4> <p>BT Group claims to have pulled off a record build rate of more than a million premises in the final three months of 2024 amid efforts to install fiber connectivity across the UK and fierce competition from altnets.…</p>","id":"tag:theregister.com,2005:story238279","isoDate":"2025-01-31T11:12:37.000Z"},{"title":"European Space Agency picks Thales Alenia Space to build lunar lander","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/european_space_agency_taps_thales/","pubDate":"2025-01-31T10:17:56.000Z","author":"Richard Speed","summary":"<h4>ESA and the Argonauts</h4> <p>The European Space Agency (ESA) has inked a deal worth €862 million with Thales Alenia Space to develop a lunar lander.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238281","isoDate":"2025-01-31T10:17:56.000Z"},{"title":"Another banner year for ransomware gangs despite takedowns by the cops","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/banner_year_for_ransomware_gangs/","pubDate":"2025-01-31T09:00:16.000Z","author":"Jessica Lyons","summary":"<h4>And it doesn't take a crystal ball to predict the future</h4> <p>If the nonstop flood of ransomware attacks doesn't already make every day feel like Groundhog Day, then a look back at 2024 – and predictions for 2025 – definitely will.…</p>","id":"tag:theregister.com,2005:story238289","isoDate":"2025-01-31T09:00:16.000Z"},{"title":"Arrr! Can a sailor's marlinspike fix a busted backplane?","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/on_call/","pubDate":"2025-01-31T08:14:08.000Z","author":"Simon Sharwood","summary":"<h4>'Ancient mariner' who came to make the fix in historical costume was such a shock nobody made a pirate joke</h4> <p><strong>On Call</strong>  Tech support people play many roles, and <i>The Register</i> celebrates them all in On Call, our reader-contributed Friday column in which we share your tales of adventure.…</p>","id":"tag:theregister.com,2005:story238154","isoDate":"2025-01-31T08:14:08.000Z"},{"title":"Googlers asked if they'd like to bury themselves next to Stadia, Chromecast, DropCam","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/googles_latest_layoffs_buyout/","pubDate":"2025-01-31T07:34:11.000Z","author":"Brandon Vigliarolo","summary":"<h4>That's one way to focus the Platforms &amp; Devices team</h4> <p>Google's latest round of layoffs is looking a bit different than usual, with the Chocolate Factory offering a buyout to employees in the recently created Platforms &amp; Devices division.…</p>","id":"tag:theregister.com,2005:story238288","isoDate":"2025-01-31T07:34:11.000Z"},{"title":"Asteroid as wide as 886 cans of spam may hit Earth in 2032","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/asteroid_earth_impact/","pubDate":"2025-01-31T06:07:14.000Z","author":"Iain Thomson","summary":"<h4>Is this NEO the one? Yup, as in, a 1% chance of hitting us ... sadly</h4> <p><strong>Video</strong>  Astronomers reckon a 220-million-kilogram asteroid is going to swing by Earth in 2032 with a 1-in-100 chance of hitting us.…</p>","id":"tag:theregister.com,2005:story238290","isoDate":"2025-01-31T06:07:14.000Z"},{"title":"Intel sinks $19B into the red, kills Falcon Shores GPUs, delays Clearwater Forest Xeons","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/intel_q4_2024/","pubDate":"2025-01-31T02:20:33.000Z","author":"Tobias Mann","summary":"<h4>Imagine burning through $72B in one year. Did it make Sam Altman the CEO already?</h4> <p>Intel capped off a tumultuous year with a reality check for its product roadmaps.…</p> <p><!--#include virtual='/data_centre/_whitepaper_textlinks_top.html' --></p>","id":"tag:theregister.com,2005:story238291","isoDate":"2025-01-31T02:20:33.000Z"},{"title":"Google to Iran: Yes, we see you using Gemini for phishing and scripting. We're onto you","link":"https://go.theregister.com/feed/www.theregister.com/2025/01/31/state_spies_google_gemini/","pubDate":"2025-01-31T01:30:11.000Z","author":"Iain Thomson","summary":"<h4>And you, China, Russia, North Korea ... Guardrails block malware generation</h4> <p>Google says it's spotted Chinese, Russian, Iranian, and North Korean government agents using its Gemini AI for nefarious purposes, with Tehran by far the most frequent naughty user out of the four.…</p>","id":"tag:theregister.com,2005:story238286","isoDate":"2025-01-31T01:30:11.000Z"}],"link":"https://www.theregister.com/","feedUrl":"https://www.theregister.com/headlines.atom","title":"The Register","lastBuildDate":"2025-02-04T11:00:06.00Z"}